2zzyyyq/3C/CMSIS/device/n32g033.h
/**
*     Copyright (c) 2025, Nsing Technologies Inc.
* 
*     All rights reserved.
*
*     This software is the exclusive property of Nsing Technologies Inc. (Hereinafter 
* referred to as Nsing). This software, and the product of Nsing described herein 
* (Hereinafter referred to as the Product) are owned by Nsing under the laws and treaties
* of the People's Republic of China and other applicable jurisdictions worldwide.
*
*     Nsing does not grant any license under its patents, copyrights, trademarks, or other 
* intellectual property rights. Names and brands of third party may be mentioned or referred 
* thereto (if any) for identification purposes only.
*
*     Nsing reserves the right to make changes, corrections, enhancements, modifications, and 
* improvements to this software at any time without notice. Please contact Nsing and obtain 
* the latest version of this software before placing orders.

*     Although Nsing has attempted to provide accurate and reliable information, Nsing assumes 
* no responsibility for the accuracy and reliability of this software.
* 
*     It is the responsibility of the user of this software to properly design, program, and test 
* the functionality and safety of any application made of this information and any resulting product. 
* In no event shall Nsing be liable for any direct, indirect, incidental, special,exemplary, or 
* consequential damages arising in any way out of the use of this software or the Product.
*
*     Nsing Products are neither intended nor warranted for usage in systems or equipment, any
* malfunction or failure of which may cause loss of human life, bodily injury or severe property 
* damage. Such applications are deemed, "Insecure Usage".
*
*     All Insecure Usage shall be made at user's risk. User shall indemnify Nsing and hold Nsing 
* harmless from and against all claims, costs, damages, and other liabilities, arising from or related 
* to any customer's Insecure Usage.

*     Any express or implied warranty with regard to this software or the Product, including,but not 
* limited to, the warranties of merchantability, fitness for a particular purpose and non-infringement
* are disclaimed to the fullest extent permitted by law.

*     Unless otherwise explicitly permitted by Nsing, anyone may not duplicate, modify, transcribe
* or otherwise distribute this software for any purposes, in whole or in part.
*
*     Nsing products and technologies shall not be used for or incorporated into any products or systems
* whose manufacture, use, or sale is prohibited under any applicable domestic or foreign laws or regulations. 
* User shall comply with any applicable export control laws and regulations promulgated and administered by 
* the governments of any countries asserting jurisdiction over the parties or transactions.
**/

/**
*\*\file n32g033.h
*\*\author Nsing
*\*\version v1.0.0
*\*\copyright Copyright (c) 2025, Nsing Technologies Inc. All rights reserved.
**/

#ifndef __N32G033_H__
#define __N32G033_H__

#ifdef __cplusplus
extern "C" {
#endif

/** N32G033_Library_Basic **/

/** In the following line adjust the External High Speed oscillator (HSE) Startup
    Timeout value **/
#define HSI_STARTUP_TIMEOUT ((uint16_t)0x0500U) /* Time out for HSI start up */
#define LSI_STARTUP_TIMEOUT ((uint16_t)0x1000U) /* Time out for LSI start up */

#define HSI_VALUE (64000000U) /* Value of the Internal oscillator in Hz*/

#define LSI_VALUE (32000U) /* Value of the Internal Low Speed oscillator in Hz*/

#define __N32G033_STDPERIPH_VERSION_MAIN (0x01) /* [31:24] main version */
#define __N32G033_STDPERIPH_VERSION_SUB1 (0x00) /* [23:16] sub1 version */
#define __N32G033_STDPERIPH_VERSION_SUB2 (0x00) /* [15:8]  sub2 version */
#define __N32G033_STDPERIPH_VERSION_RC   (0x00) /* [7:0]  release candidate */

/**  N32G033 Standard Peripheral Library version number **/
#define __N32G033_STDPERIPH_VERSION     ((__N32G033_STDPERIPH_VERSION_MAIN << 24)\
                                        |(__N32G033_STDPERIPH_VERSION_SUB1 << 16)\
                                        |(__N32G033_STDPERIPH_VERSION_SUB2 << 8)\
                                        |(__N32G033_STDPERIPH_VERSION_RC))

/** Configuration of the Cortex-M0 Processor and Core Peripherals **/
#define __NVIC_PRIO_BITS       2 /* N32G033 uses 4 Bits for the Priority Levels    */
#define __Vendor_SysTickConfig 0 /* Set to 1 if different SysTick Config is used */

/** N32G033 Interrupt Number Definition **/
typedef enum IRQn
{
    /******  Cortex-M0 Processor Exceptions Numbers **/
    NonMaskableInt_IRQn      = -14, /* 2 Non Maskable Interrupt                            */
    HardFault_IRQn           = -13, /* 3 Hard Fault Interrupt                              */
    SVCall_IRQn              = -5,  /* 11 Cortex-M0 SV Call Interrupt                      */
    PendSV_IRQn              = -2,  /* 14 Cortex-M0 Pend SV Interrupt                      */
    SysTick_IRQn             = -1,  /* 15 Cortex-M0 System Tick Interrupt                  */

    /******  N32G033 specific Interrupt Numbers **/
    PVD_IRQn                 = 0,  /* PVD through EXTI Line 16 detection Interrupt         */
    FLASH_IRQn               = 1,  /* FLASH global Interrupt                               */
    EXTI0_6_IRQn             = 2,  /* EXTI Line0/6 Interrupt                               */
    COMP_IRQn                = 3,  /* COMP(through EXTI line 18) Interrupt                 */
    UART1_IRQn               = 4,  /* UART1 global Interrupt                               */	
    UART2_IRQn               = 5,  /* UART2 global Interrupt                               */
    TIM1_BRK_UP_TRG_COM_IRQn = 6,  /* TIM1 Break Update Trigger and Commutation Interrupt  */	
    TIM1_CC_IRQn             = 7,  /* TIM1 Capture Compare Interrupt                       */	
    ADC_IRQn                 = 8,  /* ADC global Interrupts                                */	
    SPI1_IRQn                = 9,  /* SPI1 global Interrupts                               */	
    IWDG_IRQn                = 10, /* IWDG global Interrupts                               */	
    TIM4_IRQn                = 11, /* TIM4 global Interrupt                                */	
    TIM3_IRQn                = 12, /* TIM3 global Interrupt                                */
    TIM6_IRQn                = 13, /* TIM6 global Interrupt                                */
    UART3_IRQn               = 14, /* UART3 global Interrupt                               */
    SPI2_IRQn                = 15, /* SPI2 global Interrupts                               */
    I2C1_EV_IRQn             = 16, /* I2C1 event Interrupts                                */
    I2C1_ER_IRQn             = 17, /* I2C1 error Interrupts                                */
    I2C2_EV_IRQn             = 18, /* I2C2 event Interrupts                                */
    I2C2_ER_IRQn             = 19, /* I2C2 error Interrupts                                */
    DMA_IRQn                 = 20, /* DMA global Interrupt                                 */
} IRQn_Type;

#include "core_cm0.h"
#include "system_n32g033.h"
#include <stdint.h>
#include <stdbool.h>

typedef int32_t s32;
typedef int16_t s16;
typedef int8_t s8;

typedef const int32_t sc32; /* Read Only */
typedef const int16_t sc16; /* Read Only */
typedef const int8_t sc8;   /* Read Only */

typedef __IO int32_t vs32;
typedef __IO int16_t vs16;
typedef __IO int8_t vs8;

