2zzyyyq/3C/CMSIS/device/n32g033.h
typedef __I int32_t vsc32; /* Read Only */
typedef __I int16_t vsc16; /* Read Only */
typedef __I int8_t vsc8;   /* Read Only */

typedef uint32_t u32;
typedef uint16_t u16;
typedef uint8_t u8;

typedef const uint32_t uc32; /* Read Only */
typedef const uint16_t uc16; /* Read Only */
typedef const uint8_t uc8;   /* Read Only */

typedef __IO uint32_t vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t vu8;

typedef __I uint32_t vuc32; /* Read Only */
typedef __I uint16_t vuc16; /* Read Only */
typedef __I uint8_t vuc8;   /* Read Only */

typedef enum {RESET = 0, SET = !RESET} FlagStatus, INTStatus;

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;


/* N32G033 Standard Peripheral Library old definitions (maintained for legacy purpose) */
#define HSEStartUp_TimeOut HSE_STARTUP_TIMEOUT
#define HSE_Value          HSE_VALUE
#define HSI_Value          HSI_VALUE

/** Analog to Digital Converter **/
typedef struct
{
    __IO uint32_t STS;     	//0x00
	__IO uint32_t CTRL1;    //0x04 
    __IO uint32_t CTRL2;   	//0x08  
    __IO uint32_t CTRL3;	//0x0C   
    __IO uint32_t SAMPT1;	//0x10
	__IO uint32_t SAMPT2;	//0x14
	__IO uint32_t AWDHIGH;  //0x18  
	__IO uint32_t AWDLOW;	//0x1c 
	__IO uint32_t AWDEN;	//0x20  
	__IO uint32_t PHCFG;    //0x24  
	__IO uint32_t TRIGSEL;	//0x28  
	__IO uint32_t PHSWTRIG; //0x2c	
	__IO uint32_t SEQ1;	    //0x30	
  	__IO uint32_t SEQ2;	    //0x34  
    __IO uint32_t DAT0;		//0x38
    __IO uint32_t DAT1;		//0x3c	
    __IO uint32_t DAT2;	  	//0x40
    __IO uint32_t DAT3;	  	//0x44
    __IO uint32_t DAT4;		//0x48
    __IO uint32_t DAT5;		//0x4c
    __IO uint32_t DAT6;		//0x50	
    __IO uint32_t DAT7;	  	//0x54
    __IO uint32_t DAT8;		//0x58		
    __IO uint32_t DAT9;		//0x5c	
    __IO uint32_t DATI;		//0x5c				
} ADC_Module;

/** OPAMP **/
typedef struct
{
    __IO uint32_t OPAMP1_CS;  //0x00 
    __IO uint32_t OPAMP2_CS;  //0x04 
    __IO uint32_t OPAMP3_CS;  //0x08
    __IO uint32_t LOCK;       //0x0C
    __IO uint32_t VREFSEL;    //0x10
} OPAMP_Module;

/** COMP **/
typedef struct
{
    __IO uint32_t INTEN;     //0x00
    __IO uint32_t INTSTS;    //0x04
    __IO uint32_t RES1;      //0x08
    __IO uint32_t LOCK;      //0x0C
    __IO uint32_t CTRL;      //0x10
    __IO uint32_t FILC;      //0x14
    __IO uint32_t FILP;      //0x18 
    __IO uint32_t RES2[9];   //0x1C ~ 0x3C
    __IO uint32_t INVREF;    //0x40 
} COMP_Module;

/*** DMA Controller ***/
typedef struct
{
    __IO uint32_t CHCFG;		//0x08+20 * (x-1)
    __IO uint32_t TXNUM;		//0x0c+20 * (x-1)
    __IO uint32_t PADDR;		//0x10+20 * (x-1)
    __IO uint32_t MADDR;		//0x14+20 * (x-1)
    __IO uint32_t CHSEL;		//0x18+20 * (x-1)
} DMA_ChannelType;

typedef struct
{
    __IO uint32_t INTSTS;					//0x00
    __IO uint32_t INTCLR;					//0x04
    __IO DMA_ChannelType DMA_Channel[3];
} DMA_Module;

/** External Interrupt/Event Controller **/
typedef struct
{
	__IO uint32_t EMASK;    /*offset 0x00*/
    __IO uint32_t IMASK;    /*offset 0x04*/
    __IO uint32_t FT_CFG;   /*offset 0x08*/
    __IO uint32_t RT_CFG;   /*offset 0x0C*/
    __IO uint32_t PEND;     /*offset 0x10*/
	__IO uint32_t SWIE;     /*offset 0x14*/
} EXTI_Module;

/** FLASH Registers **/
typedef struct
{
    __IO uint32_t AC;
    __IO uint32_t KEY;
    __IO uint32_t OPTKEY;
    __IO uint32_t STS;
    __IO uint32_t CTRL;
    __IO uint32_t ADD;
	__IO uint32_t OB2;
    __IO uint32_t OB;
    __IO uint32_t WRP;      //0X20  
	uint32_t RESERVED[11];
    __IO uint32_t VTOR;     //0X50
} FLASH_Module;

/** Option Bytes Registers **/
typedef struct
{
    __IO uint32_t USER4_RDP1;	//0x00 
    __IO uint32_t USER0;        //0x04	
    __IO uint32_t USER1;        //0x08
    __IO uint32_t USER3_USER2;  //0x0C		
	__IO uint32_t Data1_Data0;  //0x10
	__IO uint32_t WRP1_WRP0;    //0x14
    __IO uint32_t RDP2;   		//0x18	
} OB_Module;


/** General Purpose I/O **/
typedef struct
{
    __IO uint32_t PMODE;  /*offset 0x00*/
    __IO uint32_t POTYPE; /*offset 0x04*/
    uint32_t RESERVED0;   
    __IO uint32_t PUPD;   /*offset 0x0C*/
    __IO uint32_t PID;    /*offset 0x10*/
    __IO uint32_t POD;    /*offset 0x14*/
    __IO uint32_t PBSC;   /*offset 0x18*/
    __IO uint32_t PLOCK;  /*offset 0x1C*/
    __IO uint32_t AFL;    /*offset 0x20*/
    __IO uint32_t AFH;    /*offset 0x24*/
    __IO uint32_t PBC;    /*offset 0x28*/
	__IO uint32_t DS;     /*offset 0x2C*/
} GPIO_Module;

/** Alternate Function I/O **/
typedef struct
{
    __IO uint32_t CFG;
    uint32_t RESERVED0;
    __IO uint32_t EXTI_CFG[2];
    __IO uint32_t DIGEFT_CFG1;
    __IO uint32_t DIGEFT_CFG2;
    __IO uint32_t DIGEFT_CFG3;
} AFIO_Module;

/** Inter Integrated Circuit Interface **/
typedef struct
{
    __IO uint32_t CTRL1;          //0x00 
    __IO uint32_t CTRL2;          //0x04
    __IO uint16_t OADDR1;         //0x08
    uint16_t  RESERVED1;
    __IO uint16_t OADDR2;         //0x0C
    uint16_t  RESERVED2;
    __IO uint16_t DAT;            //0x10
    uint16_t  RESERVED3; 
    __IO uint32_t STS1;           //0x14  
    __IO uint32_t STS2;           //0x18  
    __IO uint16_t CLKCTRL;        //0x1C
    uint16_t  RESERVED4;
    __IO uint16_t TMRISE;         //0x20
    uint16_t  RESERVED5; 
    uint32_t RESERVED6;           //0x24   
    __IO uint16_t GFLTRCTRL;      //0x28
    uint16_t  RESERVED10; 
} I2C_Module;

/** Independent WATCHDOG **/
typedef struct
{
    __IO uint32_t KEY;    //0x00
    __IO uint32_t STS;    //0x04
    __IO uint32_t PREDIV; //0x08
    __IO uint32_t RELV;   //0x0C
    __IO uint32_t CTRL;	  //0x10
} IWDG_Module;

/**  Power Control **/
typedef struct
{
	__IO uint32_t CTRL;       //0x00
	__IO uint32_t CTRLSTS;    //0x04
	__IO uint32_t CTRL2;      //0x08
	__IO uint32_t DBG_CTRL;   //0x0C
} PWR_Module;


/** Reset and Clock Control **/
typedef struct
{
    __IO uint32_t CTRL;      //0x0
    __IO uint32_t CFG;       //0x4
    __IO uint32_t CLKINT;    //0x8
    __IO uint32_t APBPRST;   //0xC
    __IO uint32_t AHBPCLKEN; //0x10
    __IO uint32_t APBPCLKEN; //0x14
    uint32_t RESERVED0;      //0x18
    __IO uint32_t CTRLSTS;   //0x1C
    __IO uint32_t AHBPRST;   //0x20
    __IO uint32_t CFG2;      //0x24
    uint32_t RESERVED1;      //0x28
	__IO uint32_t LSICAL;    //0x2C
	__IO uint32_t EMCCTRL;   //0x30
	__IO uint32_t LSCTRL;    //0x34
	__IO uint32_t TIMFILTCFG; //0x38
} RCC_Module;

