2zzyyyq/3C/CMSIS/device/n32g033.h
/** Serial Peripheral Interface **/
typedef struct
{
    __IO uint32_t CTRL1;   // 0x00
    __IO uint32_t CTRL2;   // 0x04
    __IO uint32_t STS;     // 0x08
    __IO uint32_t DAT;     // 0x0C
    __IO uint32_t CRCTDAT; // 0x10
    __IO uint32_t CRCRDAT; // 0x14
    __IO uint32_t CRCPOLY; // 0x18
    __IO uint32_t RESERVED0[7]; // 0x1C
    __IO uint32_t CTRL3;   // 0x38
} SPI_Module;

/** TIM **/
typedef struct
{
    __IO uint32_t CTRL1;    //0x00
    __IO uint32_t CTRL2;   	//0x04
    __IO uint32_t STS;	    //0x08
    __IO uint32_t EVTGEN;	//0x0C
    __IO uint32_t SMCTRL;	//0x10
    __IO uint32_t DINTEN;	//0x14
    __IO uint32_t CCMOD1;	//0x18
    __IO uint32_t CCMOD2;	//0x1C
    __IO uint32_t CCMOD3;	//0x20
    __IO uint32_t CCEN;	    //0x24
    __IO uint32_t CCDAT1;	//0x28
    __IO uint32_t CCDAT2;	//0x2C
    __IO uint32_t CCDAT3;	//0x30
    __IO uint32_t CCDAT4;	//0x34
    __IO uint32_t CCDAT5;	//0x38
    __IO uint32_t CCDAT6;	//0x3C    
    __IO uint32_t PSC;	    //0x40   
    __IO uint32_t AR;	    //0x44
    __IO uint32_t CNT;	    //0x48
    __IO uint32_t REPCNT;	//0x4C
    __IO uint32_t BKDT;	    //0x50
    __IO uint32_t CCDAT7;	//0x54
    __IO uint32_t RESERVED0[2];	//0x58 //0x5C
    __IO uint32_t BKFR;	    //0x60
    __IO uint32_t C1FILT;	//0x64
    __IO uint32_t C2FILT;	//0x68
    __IO uint32_t C3FILT;	//0x6C
    __IO uint32_t RESERVED1;	//0x70
    __IO uint32_t FILTO;	//0x74
    __IO uint32_t RESERVED2;	//0x78
    __IO uint32_t AF1;	    //0x7C
    __IO uint32_t RESERVED3[2];	//0x80//0x84
    __IO uint32_t ENCDAT;	//0x88
    __IO uint32_t ENCMCTRL;	//0x8C
    __IO uint32_t ENCLVR;	//0x90    
    __IO uint32_t DCTRL;	//0x94
    __IO uint32_t DADDR;	//0x98
} TIM_Module;

/** Universal Synchronous Asynchronous Receiver Transmitter **/
typedef struct
{
    __IO uint32_t CTRL1;    //0x00
    __IO uint32_t CTRL2;    //0x04
    __IO uint32_t CTRL3;    //0x08
    __IO uint32_t STS;      //0x0C
    __IO uint32_t DAT;      //0x10
    __IO uint32_t BRCF;     //0x14
    __IO uint32_t GTP;      //0x18
    __IO uint32_t FIFO;     //0x1C
    __IO uint32_t IFW;      //0x20
    __IO uint32_t RTO;      //0x24
    __IO uint32_t WKUP;     //0x28
} UART_Module;


/** HDIV **/
typedef struct
{
    __IO uint32_t CTRLSTS;
    __IO uint32_t DIVIDEND;
    __IO uint32_t DIVISOR;
    __IO uint32_t QUOTIENT;
    __IO uint32_t REMAINDER;
    __IO uint32_t DIVBY0;
} HDIV_Module;

/** SQRT **/
typedef struct
{
    __IO uint32_t CTRLSTS;
    __IO uint32_t RADICAND;
    __IO uint32_t ROOT;
} SQRT_Module;


#define FLASH_BASE  ((uint32_t)0x08000000) /* FLASH base address in the alias region */
#define SRAM_BASE   ((uint32_t)0x20000000) /* SRAM base address in the alias region */
#define PERIPH_BASE ((uint32_t)0x40000000) /* Peripheral base address in the alias region */

#define UCID_BASE          ((uint32_t)0x1FFFF4D0) /* UCID Address */
#define UCID_LENGTH        ((uint8_t)0x10)        /* UCID Length : 16 Bytes */
#define UID_BASE           ((uint32_t)0x1FFFF500) /* UID Address */
#define UID_LENGTH         ((uint8_t)0x0C)        /* UID Length : 12 Bytes */
#define DBGMCU_ID_BASE     ((uint32_t)0x1FFFF510) /* DBGMCU_ID Address */
#define DBGMCU_ID_LENGTH   ((uint8_t)0x08)        /* DBGMCU_ID Length : 8 Bytes */

/* Peripheral memory map */
#define APBPERIPH_BASE  (PERIPH_BASE + 0x10000)
#define AHBPERIPH_BASE  (PERIPH_BASE + 0x20000)

/* APB */
#define TIM3_BASE          (APBPERIPH_BASE + 0x0400 - 0x10000)
#define TIM6_BASE          (APBPERIPH_BASE + 0x1000 - 0x10000)
#define OPA_BASE           (APBPERIPH_BASE + 0x2000 - 0x10000)
#define COMP_BASE          (APBPERIPH_BASE + 0x2400 - 0x10000)
#define IWDG_BASE          (APBPERIPH_BASE + 0x3000 - 0x10000)
#define UART2_BASE         (APBPERIPH_BASE + 0x4400 - 0x10000)
#define UART3_BASE         (APBPERIPH_BASE + 0x4800 - 0x10000)
#define I2C1_BASE          (APBPERIPH_BASE + 0x5400 - 0x10000)
#define I2C2_BASE          (APBPERIPH_BASE + 0x5800 - 0x10000)
#define PWR_BASE           (APBPERIPH_BASE + 0x7000 - 0x10000)
#define EXTI_BASE          (APBPERIPH_BASE + 0x0400)
#define SPI1_BASE          (APBPERIPH_BASE + 0x2000)
#define TIM1_BASE          (APBPERIPH_BASE + 0x2C00)
#define TIM4_BASE          (APBPERIPH_BASE + 0x3400)
#define UART1_BASE         (APBPERIPH_BASE + 0x3800)
#define SPI2_BASE          (APBPERIPH_BASE + 0x4400)

/* AHB */
#define DMA_BASE           (AHBPERIPH_BASE + 0x0000)
#define DMA_CH1_BASE       (AHBPERIPH_BASE + 0x0008)
#define DMA_CH2_BASE       (AHBPERIPH_BASE + 0x001C)
#define DMA_CH3_BASE       (AHBPERIPH_BASE + 0x0030)
#define SQRT_BASE          (AHBPERIPH_BASE + 0x0400)
#define ADC_BASE           (AHBPERIPH_BASE + 0x0800)
#define RCC_BASE           (AHBPERIPH_BASE + 0x1000)
#define FLASH_R_BASE       (AHBPERIPH_BASE + 0x2000) /* Flash registers base address */
#define OB_BASE            ((uint32_t)0x1FFFF600U)    /* Flash Option Bytes base address */
#define GPIOA_BASE         (AHBPERIPH_BASE + 0x3000) 
#define GPIOB_BASE         (AHBPERIPH_BASE + 0x3100) 
#define GPIOF_BASE         (AHBPERIPH_BASE + 0x3200) 
#define AFIO_BASE          (AHBPERIPH_BASE + 0x3300)
#define HDIV_BASE          (AHBPERIPH_BASE + 0x8000)

#define TIM3        ((TIM_Module*)TIM3_BASE)
#define TIM6        ((TIM_Module*)TIM6_BASE)
#define OPAMP       ((OPAMP_Module*)OPA_BASE)
#define COMP        ((COMP_Module*)COMP_BASE)
#define IWDG        ((IWDG_Module*)IWDG_BASE)
#define UART2       ((UART_Module*)UART2_BASE)
#define UART3       ((UART_Module*)UART3_BASE)
#define I2C1        ((I2C_Module*)I2C1_BASE)
#define I2C2        ((I2C_Module*)I2C2_BASE)
#define PWR         ((PWR_Module*)PWR_BASE)
#define EXTI        ((EXTI_Module*)EXTI_BASE)
#define SPI1        ((SPI_Module*)SPI1_BASE)
#define TIM1        ((TIM_Module*)TIM1_BASE)
#define TIM4        ((TIM_Module*)TIM4_BASE)
#define UART1       ((UART_Module*)UART1_BASE)
#define SPI2        ((SPI_Module*)SPI2_BASE)
#define DMA         ((DMA_Module*)DMA_BASE)
#define DMA_CH1     ((DMA_ChannelType*)DMA_CH1_BASE)
#define DMA_CH2     ((DMA_ChannelType*)DMA_CH2_BASE)
#define DMA_CH3     ((DMA_ChannelType*)DMA_CH3_BASE)
#define SQRT        ((SQRT_Module*)SQRT_BASE)
#define ADC         ((ADC_Module*)ADC_BASE)
#define RCC         ((RCC_Module*)RCC_BASE)
#define FLASH       ((FLASH_Module*)FLASH_R_BASE)
#define GPIOA       ((GPIO_Module*)GPIOA_BASE)
#define GPIOB       ((GPIO_Module*)GPIOB_BASE)
#define GPIOF       ((GPIO_Module*)GPIOF_BASE)
#define AFIO        ((AFIO_Module*)AFIO_BASE)
#define HDIV        ((HDIV_Module*)HDIV_BASE)
#define OBT         ((OB_Module*)OB_BASE)




/***  Peripheral Registers_Bits_Definition   ***/
/******************************************************************************/
/*                                                                            */
/*                             Power Control                                  */
/*                                                                            */
/******************************************************************************/
/******** Bit definition for PWR_CTRL register  ********/
#define PWR_CTRL_NRSTCNT                                 ((uint32_t)0x00780000U)         /* Bit[22:19] */
#define PWR_CTRL_NRSTCNT_0                               ((uint32_t)0x00080000U)         /* Bit19*/
#define PWR_CTRL_NRSTCNT_1                               ((uint32_t)0x00100000U)         /* Bit20*/
#define PWR_CTRL_NRSTCNT_2                               ((uint32_t)0x00200000U)         /* Bit21*/
#define PWR_CTRL_NRSTCNT_3                               ((uint32_t)0x00400000U)         /* Bit22*/
#define PWR_CTRL_PVDCNT                                  ((uint32_t)0x0007C000U)         /* Bit[18:14] */
#define PWR_CTRL_PVDCNT_0                                ((uint32_t)0x00004000U)         /* Bit14*/
#define PWR_CTRL_PVDCNT_1                                ((uint32_t)0x00008000U)         /* Bit15*/
#define PWR_CTRL_PVDCNT_2                                ((uint32_t)0x00010000U)         /* Bit16*/
#define PWR_CTRL_PVDCNT_3                                ((uint32_t)0x00020000U)         /* Bit17*/
#define PWR_CTRL_PVDCNT_4                                ((uint32_t)0x00040000U)         /* Bit18*/
#define PWR_CTRL_IWDGRSTEN                               ((uint32_t)0x00001000U)         /* Bit[12] */
#define PWR_CTRL_PLS                                     ((uint32_t)0x000001E0U)         /* Bit[8:5] */
#define PWR_CTRL_PLS_0                                   ((uint32_t)0x00000020U)         /* Bit5*/
#define PWR_CTRL_PLS_1                                   ((uint32_t)0x00000040U)         /* Bit6*/
#define PWR_CTRL_PLS_2                                   ((uint32_t)0x00000080U)         /* Bit7*/
#define PWR_CTRL_PLS_3                                   ((uint32_t)0x00000100U)         /* Bit8*/
#define PWR_CTRL_PVDEN                                   ((uint32_t)0x00000010U)         /* Bit[4] */

/******** Bit definition for PWR_CTRLSTS register  ********/
#define PWR_CTRLSTS_PVDO                                    ((uint32_t)0x00000004U)         /* Bit[2] */

/******** Bit definition for PWR_CTRL2 register  ********/
#define PWR_CTRL2_MRLPDLY                                 ((uint32_t)0x00001FFEU)         /* Bit[12:1] */
#define PWR_CTRL2_MRLPDLY_0                               ((uint32_t)0x00000002U)         /* Bit1*/
#define PWR_CTRL2_MRLPDLY_1                               ((uint32_t)0x00000004U)         /* Bit2*/
#define PWR_CTRL2_MRLPDLY_2                               ((uint32_t)0x00000008U)         /* Bit3*/
#define PWR_CTRL2_MRLPDLY_3                               ((uint32_t)0x00000010U)         /* Bit4*/
#define PWR_CTRL2_MRLPDLY_4                               ((uint32_t)0x00000020U)         /* Bit5*/
#define PWR_CTRL2_MRLPDLY_5                               ((uint32_t)0x00000040U)         /* Bit6*/
#define PWR_CTRL2_MRLPDLY_6                               ((uint32_t)0x00000080U)         /* Bit7*/
#define PWR_CTRL2_MRLPDLY_7                               ((uint32_t)0x00000100U)         /* Bit8*/
#define PWR_CTRL2_MRLPDLY_8                               ((uint32_t)0x00000200U)         /* Bit9*/
#define PWR_CTRL2_MRLPDLY_9                               ((uint32_t)0x00000400U)         /* Bit10*/
#define PWR_CTRL2_MRLPDLY_10                              ((uint32_t)0x00000800U)         /* Bit11*/
#define PWR_CTRL2_MRLPDLY_11                              ((uint32_t)0x00001000U)         /* Bit12*/
#define PWR_CTRL2_MRLPEN                                  ((uint32_t)0x00000001U)         /* Bit[0] */

