2zzyyyq/3C/CMSIS/device/n32g033.h
/******** Bit definition for DBG_CTRL register  ********/
#define DBG_CTRL_TIM6STP                                 ((uint32_t)0x00040000U)         /* Bit[18] */
#define DBG_CTRL_I2C2TIMOUT                              ((uint32_t)0x00010000U)         /* Bit[16] */
#define DBG_CTRL_I2C1TIMOUT                              ((uint32_t)0x00008000U)         /* Bit[15] */
#define DBG_CTRL_TIM4STP                                 ((uint32_t)0x00002000U)         /* Bit[13] */
#define DBG_CTRL_TIM3STP                                 ((uint32_t)0x00001000U)         /* Bit[12] */
#define DBG_CTRL_TIM1STP                                 ((uint32_t)0x00000400U)         /* Bit[10] */
#define DBG_CTRL_IWDGSTP                                 ((uint32_t)0x00000100U)         /* Bit[8] */


/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/

/******** Bit definition for RCC_CTRL register  ********/
#define RCC_CTRL_HSITRIM                                 ((uint32_t)0x007FE000U)         /* Bit[22:13] */
#define RCC_CTRL_HSITRIM_0                               ((uint32_t)0x00002000U)         /* Bit13*/
#define RCC_CTRL_HSITRIM_1                               ((uint32_t)0x00004000U)         /* Bit14*/
#define RCC_CTRL_HSITRIM_2                               ((uint32_t)0x00008000U)         /* Bit15*/
#define RCC_CTRL_HSITRIM_3                               ((uint32_t)0x00010000U)         /* Bit16*/
#define RCC_CTRL_HSITRIM_4                               ((uint32_t)0x00020000U)         /* Bit17*/
#define RCC_CTRL_HSITRIM_5                               ((uint32_t)0x00040000U)         /* Bit18*/
#define RCC_CTRL_HSITRIM_6                               ((uint32_t)0x00080000U)         /* Bit19*/
#define RCC_CTRL_HSITRIM_7                               ((uint32_t)0x00100000U)         /* Bit20*/
#define RCC_CTRL_HSITRIM_8                               ((uint32_t)0x00200000U)         /* Bit21*/
#define RCC_CTRL_HSITRIM_9                               ((uint32_t)0x00400000U)         /* Bit22*/
#define RCC_CTRL_LSICALCF                                ((uint32_t)0x00000800U)         /* Bit[11] */
#define RCC_CTRL_LSICALLEN                               ((uint32_t)0x00000600U)         /* Bit[10:9] */
#define RCC_CTRL_LSICALLEN_0                             ((uint32_t)0x00000200U)         /* Bit9*/
#define RCC_CTRL_LSICALLEN_1                             ((uint32_t)0x00000400U)         /* Bit10*/
#define RCC_CTRL_LSICALEN                                ((uint32_t)0x00000100U)         /* Bit[8] */
#define RCC_CTRL_HSIRDF                                  ((uint32_t)0x00000002U)         /* Bit[1] */
#define RCC_CTRL_HSIEN                                   ((uint32_t)0x00000001U)         /* Bit[0] */

/******** Bit definition for RCC_CFG register  ********/
#define RCC_CFG_MCOPRES                                 ((uint32_t)0x70000000U)         /* Bit[30:28] */
#define RCC_CFG_MCOPRES_0                               ((uint32_t)0x10000000U)         /* Bit28*/
#define RCC_CFG_MCOPRES_1                               ((uint32_t)0x20000000U)         /* Bit29*/
#define RCC_CFG_MCOPRES_2                               ((uint32_t)0x40000000U)         /* Bit30*/
#define RCC_CFG_MCO                                     ((uint32_t)0x0C000000U)         /* Bit[27:26] */
#define RCC_CFG_MCO_0                                   ((uint32_t)0x04000000U)         /* Bit26*/
#define RCC_CFG_MCO_1                                   ((uint32_t)0x08000000U)         /* Bit27*/
#define RCC_CFG_SYSPRES                                 ((uint32_t)0x00010000U)         /* Bit[16] */
#define RCC_CFG_TIMXCLKSEL                              ((uint32_t)0x00002000U)         /* Bit[13] */
#define RCC_CFG_TIM6CLKSEL                              ((uint32_t)0x00001000U)         /* Bit[12] */
#define RCC_CFG_UART3CLKSEL                             ((uint32_t)0x00000800U)         /* Bit[11] */
#define RCC_CFG_APBPRES                                 ((uint32_t)0x00000700U)         /* Bit[10:8] */
#define RCC_CFG_APBPRES_0                               ((uint32_t)0x00000100U)         /* Bit8*/
#define RCC_CFG_APBPRES_1                               ((uint32_t)0x00000200U)         /* Bit9*/
#define RCC_CFG_APBPRES_2                               ((uint32_t)0x00000400U)         /* Bit10*/
#define RCC_CFG_AHBPRES                                 ((uint32_t)0x00000070U)         /* Bit[6:4] */
#define RCC_CFG_AHBPRES_0                               ((uint32_t)0x00000010U)         /* Bit4*/
#define RCC_CFG_AHBPRES_1                               ((uint32_t)0x00000020U)         /* Bit5*/
#define RCC_CFG_AHBPRES_2                               ((uint32_t)0x00000040U)         /* Bit6*/
#define RCC_CFG_SCLKSTS                                 ((uint32_t)0x00000002U)         /* Bit[1] */
#define RCC_CFG_SCLKSW                                  ((uint32_t)0x00000001U)         /* Bit[0] */

#define RCC_CFG_SCLKSTS_HSI                             ((uint32_t)0x00000000U) /* HSI clock used as system clock*/
#define RCC_CFG_SCLKSTS_LSI                             ((uint32_t)0x00000002U) /* LSI oscillator used as system clock */

/******** Bit definition for RCC_CLKINT register  ********/
#define RCC_CLKINT_HSIRDCLR                                ((uint32_t)0x00040000U)         /* Bit[18] */
#define RCC_CLKINT_LSIRDCLR                                ((uint32_t)0x00010000U)         /* Bit[16] */
#define RCC_CLKINT_HSIRDF                                  ((uint32_t)0x00000004U)         /* Bit[2] */
#define RCC_CLKINT_LSIRDF                                  ((uint32_t)0x00000001U)         /* Bit[0] */

/******** Bit definition for RCC_APBPRST register  ********/
#define RCC_APBPRST_OPARST                                  ((uint32_t)0x80000000U)         /* Bit[31] */
#define RCC_APBPRST_COMPRST                                 ((uint32_t)0x20000000U)         /* Bit[29] */
#define RCC_APBPRST_UART3RST                                ((uint32_t)0x00040000U)         /* Bit[18] */
#define RCC_APBPRST_UART2RST                                ((uint32_t)0x00020000U)         /* Bit[17] */
#define RCC_APBPRST_UART1RST                                ((uint32_t)0x00010000U)         /* Bit[16] */
#define RCC_APBPRST_TIM6RST                                 ((uint32_t)0x00008000U)         /* Bit[15] */
#define RCC_APBPRST_TIM4RST                                 ((uint32_t)0x00004000U)         /* Bit[14] */
#define RCC_APBPRST_TIM3RST                                 ((uint32_t)0x00002000U)         /* Bit[13] */
#define RCC_APBPRST_TIM1RST                                 ((uint32_t)0x00001000U)         /* Bit[12] */
#define RCC_APBPRST_SPI2RST                                 ((uint32_t)0x00000400U)         /* Bit[10] */
#define RCC_APBPRST_SPI1RST                                 ((uint32_t)0x00000200U)         /* Bit[9] */
#define RCC_APBPRST_I2C2RST                                 ((uint32_t)0x00000004U)         /* Bit[2] */
#define RCC_APBPRST_I2C1RST                                 ((uint32_t)0x00000002U)         /* Bit[1] */
#define RCC_APBPRST_IOMRST                                  ((uint32_t)0x00000001U)         /* Bit[0] */

