2zzyyyq/3C/CMSIS/device/n32g033.h
/******** Bit definition for RCC_AHBPCLKEN register  ********/
#define RCC_AHBPCLKEN_ADCEN                                   ((uint32_t)0x00001000U)         /* Bit[12] */
#define RCC_AHBPCLKEN_HDIVEN                                  ((uint32_t)0x00000080U)         /* Bit[7] */
#define RCC_AHBPCLKEN_SQRTEN                                  ((uint32_t)0x00000020U)         /* Bit[5] */
#define RCC_AHBPCLKEN_DMAEN                                   ((uint32_t)0x00000001U)         /* Bit[0] */

/******** Bit definition for RCC_APBPCLKEN register  ********/
#define RCC_APBPCLKEN_OPAEN                                   ((uint32_t)0x80000000U)         /* Bit[31] */
#define RCC_APBPCLKEN_COMPFILTEN                              ((uint32_t)0x40000000U)         /* Bit[30] */
#define RCC_APBPCLKEN_COMPEN                                  ((uint32_t)0x20000000U)         /* Bit[29] */
#define RCC_APBPCLKEN_UART3EN                                 ((uint32_t)0x00040000U)         /* Bit[18] */
#define RCC_APBPCLKEN_UART2EN                                 ((uint32_t)0x00020000U)         /* Bit[17] */
#define RCC_APBPCLKEN_UART1EN                                 ((uint32_t)0x00010000U)         /* Bit[16] */
#define RCC_APBPCLKEN_TIM6EN                                  ((uint32_t)0x00008000U)         /* Bit[15] */
#define RCC_APBPCLKEN_TIM4EN                                  ((uint32_t)0x00004000U)         /* Bit[14] */
#define RCC_APBPCLKEN_TIM3EN                                  ((uint32_t)0x00002000U)         /* Bit[13] */
#define RCC_APBPCLKEN_TIM1EN                                  ((uint32_t)0x00001000U)         /* Bit[12] */
#define RCC_APBPCLKEN_SPI2EN                                  ((uint32_t)0x00000400U)         /* Bit[10] */
#define RCC_APBPCLKEN_SPI1EN                                  ((uint32_t)0x00000200U)         /* Bit[9] */
#define RCC_APBPCLKEN_PWREN                                   ((uint32_t)0x00000008U)         /* Bit[3] */
#define RCC_APBPCLKEN_I2C2EN                                  ((uint32_t)0x00000004U)         /* Bit[2] */
#define RCC_APBPCLKEN_I2C1EN                                  ((uint32_t)0x00000002U)         /* Bit[1] */
#define RCC_APBPCLKEN_IOMEN                                   ((uint32_t)0x00000001U)         /* Bit[0] */

/******** Bit definition for RCC_CTRLSTS register  ********/
#define RCC_CTRLSTS_LKUPRSTF                                ((uint32_t)0x00000800U)         /* Bit[11] */
#define RCC_CTRLSTS_EMCGBNF                                 ((uint32_t)0x00000200U)         /* Bit[9] */
#define RCC_CTRLSTS_EMCGBF                                  ((uint32_t)0x00000100U)         /* Bit[8] */
#define RCC_CTRLSTS_GLITCHRSTF                              ((uint32_t)0x00000080U)         /* Bit[7] */
#define RCC_CTRLSTS_IWDGRSTF                                ((uint32_t)0x00000040U)         /* Bit[6] */
#define RCC_CTRLSTS_SFTRSTF                                 ((uint32_t)0x00000020U)         /* Bit[5] */
#define RCC_CTRLSTS_PORRSTF                                 ((uint32_t)0x00000010U)         /* Bit[4] */
#define RCC_CTRLSTS_PINRSTF                                 ((uint32_t)0x00000008U)         /* Bit[3] */
#define RCC_CTRLSTS_RMRSTF                                  ((uint32_t)0x00000001U)         /* Bit[0] */

/******** Bit definition for RCC_AHBPRST register  ********/
#define RCC_AHBPRST_ADCRST                                  ((uint32_t)0x00001000U)         /* Bit[12] */
#define RCC_AHBPRST_HDIVRST                                 ((uint32_t)0x00000080U)         /* Bit[7] */
#define RCC_AHBPRST_SQRTRST                                 ((uint32_t)0x00000020U)         /* Bit[5] */

/******** Bit definition for RCC_CFG2 register  ********/
#define RCC_CFG2_ADCHPRE                                 ((uint32_t)0x00000007U)         /* Bit[2:0] */
#define RCC_CFG2_ADCHPRE_0                               ((uint32_t)0x00000001U)         /* Bit0*/
#define RCC_CFG2_ADCHPRE_1                               ((uint32_t)0x00000002U)         /* Bit1*/
#define RCC_CFG2_ADCHPRE_2                               ((uint32_t)0x00000004U)         /* Bit2*/

/******** Bit definition for RCC_LSICAL register  ********/
#define RCC_LSICAL_HSICALCNT                               ((uint32_t)0x00FFFFFFU)         /* Bit[23:0] */
#define RCC_LSICAL_HSICALCNT_0                             ((uint32_t)0x00000001U)         /* Bit0*/
#define RCC_LSICAL_HSICALCNT_1                             ((uint32_t)0x00000002U)         /* Bit1*/
#define RCC_LSICAL_HSICALCNT_2                             ((uint32_t)0x00000004U)         /* Bit2*/
#define RCC_LSICAL_HSICALCNT_3                             ((uint32_t)0x00000008U)         /* Bit3*/
#define RCC_LSICAL_HSICALCNT_4                             ((uint32_t)0x00000010U)         /* Bit4*/
#define RCC_LSICAL_HSICALCNT_5                             ((uint32_t)0x00000020U)         /* Bit5*/
#define RCC_LSICAL_HSICALCNT_6                             ((uint32_t)0x00000040U)         /* Bit6*/
#define RCC_LSICAL_HSICALCNT_7                             ((uint32_t)0x00000080U)         /* Bit7*/
#define RCC_LSICAL_HSICALCNT_8                             ((uint32_t)0x00000100U)         /* Bit8*/
#define RCC_LSICAL_HSICALCNT_9                             ((uint32_t)0x00000200U)         /* Bit9*/
#define RCC_LSICAL_HSICALCNT_10                            ((uint32_t)0x00000400U)         /* Bit10*/
#define RCC_LSICAL_HSICALCNT_11                            ((uint32_t)0x00000800U)         /* Bit11*/
#define RCC_LSICAL_HSICALCNT_12                            ((uint32_t)0x00001000U)         /* Bit12*/
#define RCC_LSICAL_HSICALCNT_13                            ((uint32_t)0x00002000U)         /* Bit13*/
#define RCC_LSICAL_HSICALCNT_14                            ((uint32_t)0x00004000U)         /* Bit14*/
#define RCC_LSICAL_HSICALCNT_15                            ((uint32_t)0x00008000U)         /* Bit15*/
#define RCC_LSICAL_HSICALCNT_16                            ((uint32_t)0x00010000U)         /* Bit16*/
#define RCC_LSICAL_HSICALCNT_17                            ((uint32_t)0x00020000U)         /* Bit17*/
#define RCC_LSICAL_HSICALCNT_18                            ((uint32_t)0x00040000U)         /* Bit18*/
#define RCC_LSICAL_HSICALCNT_19                            ((uint32_t)0x00080000U)         /* Bit19*/
#define RCC_LSICAL_HSICALCNT_20                            ((uint32_t)0x00100000U)         /* Bit20*/
#define RCC_LSICAL_HSICALCNT_21                            ((uint32_t)0x00200000U)         /* Bit21*/
#define RCC_LSICAL_HSICALCNT_22                            ((uint32_t)0x00400000U)         /* Bit22*/
#define RCC_LSICAL_HSICALCNT_23                            ((uint32_t)0x00800000U)         /* Bit23*/

/******** Bit definition for RCC_EMCCTRL register  ********/
#define RCC_EMCCTRL_LKUPRSTEN                               ((uint32_t)0x80000000U)         /* Bit[31] */
#define RCC_EMCCTRL_GBNSW                                   ((uint32_t)0x00800000U)         /* Bit[23] */
#define RCC_EMCCTRL_GBNRST                                  ((uint32_t)0x00400000U)         /* Bit[22] */
#define RCC_EMCCTRL_GBNDET                                  ((uint32_t)0x00200000U)         /* Bit[21] */
#define RCC_EMCCTRL_GBNDETSEL                               ((uint32_t)0x00030000U)         /* Bit[17:16] */
#define RCC_EMCCTRL_GBNDETSEL_0                             ((uint32_t)0x00010000U)         /* Bit16*/
#define RCC_EMCCTRL_GBNDETSEL_1                             ((uint32_t)0x00020000U)         /* Bit17*/
#define RCC_EMCCTRL_GBSW                                    ((uint32_t)0x00008000U)         /* Bit[15] */
#define RCC_EMCCTRL_GBRST                                   ((uint32_t)0x00004000U)         /* Bit[14] */
#define RCC_EMCCTRL_GBDET                                   ((uint32_t)0x00002000U)         /* Bit[13] */
#define RCC_EMCCTRL_GBDETSEL                                ((uint32_t)0x00000300U)         /* Bit[9:8] */
#define RCC_EMCCTRL_GBDETSEL_0                              ((uint32_t)0x00000100U)         /* Bit8*/
#define RCC_EMCCTRL_GBDETSEL_1                              ((uint32_t)0x00000200U)         /* Bit9*/
#define RCC_EMCCTRL_GVSW                                    ((uint32_t)0x00000080U)         /* Bit[7] */
#define RCC_EMCCTRL_GVRST                                   ((uint32_t)0x00000040U)         /* Bit[6] */
#define RCC_EMCCTRL_GVDET                                   ((uint32_t)0x00000020U)         /* Bit[5] */
#define RCC_EMCCTRL_GVDETSEL                                ((uint32_t)0x0000001FU)         /* Bit[4:0] */
#define RCC_EMCCTRL_GVDETSEL_0                              ((uint32_t)0x00000001U)         /* Bit0*/
#define RCC_EMCCTRL_GVDETSEL_1                              ((uint32_t)0x00000002U)         /* Bit1*/
#define RCC_EMCCTRL_GVDETSEL_2                              ((uint32_t)0x00000004U)         /* Bit2*/
#define RCC_EMCCTRL_GVDETSEL_3                              ((uint32_t)0x00000008U)         /* Bit3*/
#define RCC_EMCCTRL_GVDETSEL_4                              ((uint32_t)0x00000010U)         /* Bit4*/

/******** Bit definition for RCC_LSCTRL register  ********/
#define RCC_LSCTRL_TRIMSEL                                 ((uint32_t)0x00000200U)         /* Bit[9] */
#define RCC_LSCTRL_LSITRIM                                 ((uint32_t)0x000001FFU)         /* Bit[8:0] */
#define RCC_LSCTRL_LSITRIM_0                               ((uint32_t)0x00000001U)         /* Bit0*/
#define RCC_LSCTRL_LSITRIM_1                               ((uint32_t)0x00000002U)         /* Bit1*/
#define RCC_LSCTRL_LSITRIM_2                               ((uint32_t)0x00000004U)         /* Bit2*/
#define RCC_LSCTRL_LSITRIM_3                               ((uint32_t)0x00000008U)         /* Bit3*/
#define RCC_LSCTRL_LSITRIM_4                               ((uint32_t)0x00000010U)         /* Bit4*/
#define RCC_LSCTRL_LSITRIM_5                               ((uint32_t)0x00000020U)         /* Bit5*/
#define RCC_LSCTRL_LSITRIM_6                               ((uint32_t)0x00000040U)         /* Bit6*/
#define RCC_LSCTRL_LSITRIM_7                               ((uint32_t)0x00000080U)         /* Bit7*/
#define RCC_LSCTRL_LSITRIM_8                               ((uint32_t)0x00000100U)         /* Bit8*/

/******** Bit definition for RCC_TIMFILTCFG register  ********/
#define RCC_TIMFILTCFG_IOFLITCLK                               ((uint32_t)0xF0000000U)         /* Bit[31:28] */
#define RCC_TIMFILTCFG_IOFLITCLK_0                             ((uint32_t)0x10000000U)         /* Bit28*/
#define RCC_TIMFILTCFG_IOFLITCLK_1                             ((uint32_t)0x20000000U)         /* Bit29*/
#define RCC_TIMFILTCFG_IOFLITCLK_2                             ((uint32_t)0x40000000U)         /* Bit30*/
#define RCC_TIMFILTCFG_IOFLITCLK_3                             ((uint32_t)0x80000000U)         /* Bit31*/
#define RCC_TIMFILTCFG_TIM4FILTCLK                             ((uint32_t)0x001F0000U)         /* Bit[20:16] */
#define RCC_TIMFILTCFG_TIM4FILTCLK_0                           ((uint32_t)0x00010000U)         /* Bit16*/
#define RCC_TIMFILTCFG_TIM4FILTCLK_1                           ((uint32_t)0x00020000U)         /* Bit17*/
#define RCC_TIMFILTCFG_TIM4FILTCLK_2                           ((uint32_t)0x00040000U)         /* Bit18*/
#define RCC_TIMFILTCFG_TIM4FILTCLK_3                           ((uint32_t)0x00080000U)         /* Bit19*/
#define RCC_TIMFILTCFG_TIM4FILTCLK_4                           ((uint32_t)0x00100000U)         /* Bit20*/
#define RCC_TIMFILTCFG_TIM3FILTCLK                             ((uint32_t)0x00001F00U)         /* Bit[12:8] */
#define RCC_TIMFILTCFG_TIM3FILTCLK_0                           ((uint32_t)0x00000100U)         /* Bit8*/
#define RCC_TIMFILTCFG_TIM3FILTCLK_1                           ((uint32_t)0x00000200U)         /* Bit9*/
#define RCC_TIMFILTCFG_TIM3FILTCLK_2                           ((uint32_t)0x00000400U)         /* Bit10*/
#define RCC_TIMFILTCFG_TIM3FILTCLK_3                           ((uint32_t)0x00000800U)         /* Bit11*/
#define RCC_TIMFILTCFG_TIM3FILTCLK_4                           ((uint32_t)0x00001000U)         /* Bit12*/
#define RCC_TIMFILTCFG_TIM1FILTCLK                             ((uint32_t)0x0000001FU)         /* Bit[4:0] */
#define RCC_TIMFILTCFG_TIM1FILTCLK_0                           ((uint32_t)0x00000001U)         /* Bit0*/
#define RCC_TIMFILTCFG_TIM1FILTCLK_1                           ((uint32_t)0x00000002U)         /* Bit1*/
#define RCC_TIMFILTCFG_TIM1FILTCLK_2                           ((uint32_t)0x00000004U)         /* Bit2*/
#define RCC_TIMFILTCFG_TIM1FILTCLK_3                           ((uint32_t)0x00000008U)         /* Bit3*/
#define RCC_TIMFILTCFG_TIM1FILTCLK_4                           ((uint32_t)0x00000010U)         /* Bit4*/


/*** SystemTick ***/

/*****************  Bit definition for SysTick_CTRL register  *****************/
#define SysTick_CTRL_ENABLE    ((uint32_t)0x00000001) /* Counter enable */
#define SysTick_CTRL_TICKINT   ((uint32_t)0x00000002) /* Counting down to 0 pends the SysTick handler */
#define SysTick_CTRL_CLKSOURCE ((uint32_t)0x00000004) /* Clock source */
#define SysTick_CTRL_COUNTFLAG ((uint32_t)0x00010000) /* Count Flag */

/*****************  Bit definition for SysTick_LOAD register  *****************/
#define SysTick_LOAD_RELOAD                                                                                            \
    ((uint32_t)0x00FFFFFF) /* Value to load into the SysTick Current Value Register when the counter reaches 0 */

/*****************  Bit definition for SysTick_VAL register  ******************/
#define SysTick_VAL_CURRENT ((uint32_t)0x00FFFFFF) /* Current value at the time the register is accessed */

/*****************  Bit definition for SysTick_CALIB register  ****************/
#define SysTick_CALIB_TENMS ((uint32_t)0x00FFFFFF) /* Reload value to use for 10ms timing */
#define SysTick_CALIB_SKEW  ((uint32_t)0x40000000) /* Calibration value is not exactly 10 ms */
#define SysTick_CALIB_NOREF ((uint32_t)0x80000000) /* The reference clock is not provided */

/******************************************************************************/
/*                                                                            */
/*                  Nested Vectored Interrupt Controller                      */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for NVIC_ISER register  *******************/
#define NVIC_ISER_SETENA    ((uint32_t)0xFFFFFFFF) /* Interrupt set enable bits */
#define NVIC_ISER_SETENA_0  ((uint32_t)0x00000001) /* bit 0 */
#define NVIC_ISER_SETENA_1  ((uint32_t)0x00000002) /* bit 1 */
#define NVIC_ISER_SETENA_2  ((uint32_t)0x00000004) /* bit 2 */
#define NVIC_ISER_SETENA_3  ((uint32_t)0x00000008) /* bit 3 */
#define NVIC_ISER_SETENA_4  ((uint32_t)0x00000010) /* bit 4 */
#define NVIC_ISER_SETENA_5  ((uint32_t)0x00000020) /* bit 5 */
#define NVIC_ISER_SETENA_6  ((uint32_t)0x00000040) /* bit 6 */
#define NVIC_ISER_SETENA_7  ((uint32_t)0x00000080) /* bit 7 */
#define NVIC_ISER_SETENA_8  ((uint32_t)0x00000100) /* bit 8 */
#define NVIC_ISER_SETENA_9  ((uint32_t)0x00000200) /* bit 9 */
#define NVIC_ISER_SETENA_10 ((uint32_t)0x00000400) /* bit 10 */
#define NVIC_ISER_SETENA_11 ((uint32_t)0x00000800) /* bit 11 */
#define NVIC_ISER_SETENA_12 ((uint32_t)0x00001000) /* bit 12 */
#define NVIC_ISER_SETENA_13 ((uint32_t)0x00002000) /* bit 13 */
#define NVIC_ISER_SETENA_14 ((uint32_t)0x00004000) /* bit 14 */
#define NVIC_ISER_SETENA_15 ((uint32_t)0x00008000) /* bit 15 */
#define NVIC_ISER_SETENA_16 ((uint32_t)0x00010000) /* bit 16 */
#define NVIC_ISER_SETENA_17 ((uint32_t)0x00020000) /* bit 17 */
#define NVIC_ISER_SETENA_18 ((uint32_t)0x00040000) /* bit 18 */
#define NVIC_ISER_SETENA_19 ((uint32_t)0x00080000) /* bit 19 */
#define NVIC_ISER_SETENA_20 ((uint32_t)0x00100000) /* bit 20 */
#define NVIC_ISER_SETENA_21 ((uint32_t)0x00200000) /* bit 21 */
#define NVIC_ISER_SETENA_22 ((uint32_t)0x00400000) /* bit 22 */
#define NVIC_ISER_SETENA_23 ((uint32_t)0x00800000) /* bit 23 */
#define NVIC_ISER_SETENA_24 ((uint32_t)0x01000000) /* bit 24 */
#define NVIC_ISER_SETENA_25 ((uint32_t)0x02000000) /* bit 25 */
#define NVIC_ISER_SETENA_26 ((uint32_t)0x04000000) /* bit 26 */
#define NVIC_ISER_SETENA_27 ((uint32_t)0x08000000) /* bit 27 */
#define NVIC_ISER_SETENA_28 ((uint32_t)0x10000000) /* bit 28 */
#define NVIC_ISER_SETENA_29 ((uint32_t)0x20000000) /* bit 29 */
#define NVIC_ISER_SETENA_30 ((uint32_t)0x40000000) /* bit 30 */
#define NVIC_ISER_SETENA_31 ((uint32_t)0x80000000) /* bit 31 */

