2zzyyyq/3C/CMSIS/device/n32g033.h
/** Bit definition for SCB_afsr register **/
#define SCB_AFSR_IMPDEF ((uint32_t)0xFFFFFFFFU) /* Implementation defined */

/*** DMA Controller ***/

/** Bit definition for DMA_INTSTS register **/
#define DMA_INTSTS_GLBF1 ((uint32_t)0x00000001U) /* Channel 1 Global interrupt flag */
#define DMA_INTSTS_TXCF1 ((uint32_t)0x00000002U) /* Channel 1 Transfer Complete flag */
#define DMA_INTSTS_HTXF1 ((uint32_t)0x00000004U) /* Channel 1 Half Transfer flag */
#define DMA_INTSTS_ERRF1 ((uint32_t)0x00000008U) /* Channel 1 Transfer Error flag */
#define DMA_INTSTS_GLBF2 ((uint32_t)0x00000010U) /* Channel 2 Global interrupt flag */
#define DMA_INTSTS_TXCF2 ((uint32_t)0x00000020U) /* Channel 2 Transfer Complete flag */
#define DMA_INTSTS_HTXF2 ((uint32_t)0x00000040U) /* Channel 2 Half Transfer flag */
#define DMA_INTSTS_ERRF2 ((uint32_t)0x00000080U) /* Channel 2 Transfer Error flag */
#define DMA_INTSTS_GLBF3 ((uint32_t)0x00000100U) /* Channel 3 Global interrupt flag */
#define DMA_INTSTS_TXCF3 ((uint32_t)0x00000200U) /* Channel 3 Transfer Complete flag */
#define DMA_INTSTS_HTXF3 ((uint32_t)0x00000400U) /* Channel 3 Half Transfer flag */
#define DMA_INTSTS_ERRF3 ((uint32_t)0x00000800U) /* Channel 3 Transfer Error flag */

/** Bit definition for DMA_INTCLR register **/
#define DMA_INTCLR_CGLBF1 ((uint32_t)0x00000001U) /* Channel 1 Global interrupt clear */
#define DMA_INTCLR_CTXCF1 ((uint32_t)0x00000002U) /* Channel 1 Transfer Complete clear */
#define DMA_INTCLR_CHTXF1 ((uint32_t)0x00000004U) /* Channel 1 Half Transfer clear */
#define DMA_INTCLR_CERRF1 ((uint32_t)0x00000008U) /* Channel 1 Transfer Error clear */
#define DMA_INTCLR_CGLBF2 ((uint32_t)0x00000010U) /* Channel 2 Global interrupt clear */
#define DMA_INTCLR_CTXCF2 ((uint32_t)0x00000020U) /* Channel 2 Transfer Complete clear */
#define DMA_INTCLR_CHTXF2 ((uint32_t)0x00000040U) /* Channel 2 Half Transfer clear */
#define DMA_INTCLR_CERRF2 ((uint32_t)0x00000080U) /* Channel 2 Transfer Error clear */
#define DMA_INTCLR_CGLBF3 ((uint32_t)0x00000100U) /* Channel 3 Global interrupt clear */
#define DMA_INTCLR_CTXCF3 ((uint32_t)0x00000200U) /* Channel 3 Transfer Complete clear */
#define DMA_INTCLR_CHTXF3 ((uint32_t)0x00000400U) /* Channel 3 Half Transfer clear */
#define DMA_INTCLR_CERRF3 ((uint32_t)0x00000800U) /* Channel 3 Transfer Error clear */

/** Bit definition for DMA_CHCFGx register **/
#define DMA_CHCFG_CHEN  ((uint16_t)0x0001) /* Channel enable*/
#define DMA_CHCFG_TXCIE ((uint16_t)0x0002) /* Transfer complete interrupt enable */
#define DMA_CHCFG_HTXIE ((uint16_t)0x0004) /* Half Transfer interrupt enable */
#define DMA_CHCFG_ERRIE ((uint16_t)0x0008) /* Transfer error interrupt enable */
#define DMA_CHCFG_DIR   ((uint16_t)0x0010) /* Data transfer direction */
#define DMA_CHCFG_CIRC  ((uint16_t)0x0020) /* Circular mode */
#define DMA_CHCFG_PINC  ((uint16_t)0x0040) /* Peripheral increment mode */
#define DMA_CHCFG_MINC  ((uint16_t)0x0080) /* Memory increment mode */

#define DMA_CHCFG_PSIZE   ((uint16_t)0x0300) /* PSIZE[1:0] bits (Peripheral size) */
#define DMA_CHCFG_PSIZE_0 ((uint16_t)0x0100) /* Bit 0 */
#define DMA_CHCFG_PSIZE_1 ((uint16_t)0x0200) /* Bit 1 */

#define DMA_CHCFG_MSIZE   ((uint16_t)0x0C00) /* MSIZE[1:0] bits (Memory size) */
#define DMA_CHCFG_MSIZE_0 ((uint16_t)0x0400) /* Bit 0 */
#define DMA_CHCFG_MSIZE_1 ((uint16_t)0x0800) /* Bit 1 */

#define DMA_CHCFG_PRIOLVL   ((uint16_t)0x3000) /* PRIOLVL[1:0] bits(Channel Priority level) */
#define DMA_CHCFG_PRIOLVL_0 ((uint16_t)0x1000) /* Bit 0 */
#define DMA_CHCFG_PRIOLVL_1 ((uint16_t)0x2000) /* Bit 1 */

#define DMA_CHCFG_MEM2MEM ((uint16_t)0x4000) /* Memory to memory mode */

/** Bit definition for DMA_TXNUM1 register **/
#define DMA_TXNUM1_NDTX ((uint16_t)0xFFFFU) /* CH1 number of data to transfer */

/** Bit definition for DMA_TXNUM2 register **/
#define DMA_TXNUM2_NDTX ((uint16_t)0xFFFFU) /* CH2 number of data to transfer */

/** Bit definition for DMA_TXNUM3 register **/
#define DMA_TXNUM3_NDTX ((uint16_t)0xFFFFU) /* CH3 number of data to transfer */

/** Bit definition for DMA_PADDR1 register **/
#define DMA_PADDR1_ADDR ((uint32_t)0xFFFFFFFFU) /* Peripheral Address of CH1 */

/** Bit definition for DMA_PADDR2 register **/
#define DMA_PADDR2_ADDR ((uint32_t)0xFFFFFFFFU) /* Peripheral Address of CH2 */

/** Bit definition for DMA_PADDR3 register **/
#define DMA_PADDR3_ADDR ((uint32_t)0xFFFFFFFFU) /* Peripheral Address of CH3 */

/** Bit definition for DMA_MADDR1 register **/
#define DMA_MADDR1_ADDR ((uint32_t)0xFFFFFFFFU) /* Memory Address of CH1 */

/** Bit definition for DMA_MADDR2 register **/
#define DMA_MADDR2_ADDR ((uint32_t)0xFFFFFFFFU) /* Memory Address of CH2 */

/** Bit definition for DMA_MADDR3 register **/
#define DMA_MADDR3_ADDR ((uint32_t)0xFFFFFFFFU) /* Memory Address of CH3 */

/** Bit definition for DMA_CHSELx(x=1~3) register  ***/
#define DMA_CHSEL_CH_SEL   ((uint32_t)0x0000003FU) /* CH_SEL[5:0]: Channel request select */
#define DMA_CHSEL_CH_SEL_0 ((uint32_t)0x00000001U) /* bit0 */
#define DMA_CHSEL_CH_SEL_1 ((uint32_t)0x00000002U) /* bit1 */
#define DMA_CHSEL_CH_SEL_2 ((uint32_t)0x00000004U) /* bit2 */
#define DMA_CHSEL_CH_SEL_3 ((uint32_t)0x00000008U) /* bit3 */
#define DMA_CHSEL_CH_SEL_4 ((uint32_t)0x00000010U) /* bit4 */
#define DMA_CHSEL_CH_SEL_5 ((uint32_t)0x00000020U) /* bit5 */



/***  Analog to Digital Converter ***/

/*** Bit definition for ADC_STS register  ***/
#define ADC_STS_PDRDY                                   ((uint32_t)0x00000800U)         /* Bit[11] */
#define ADC_STS_RDY                                     ((uint32_t)0x00000400U)         /* Bit[10] */
#define ADC_STS_VREFRDY                                 ((uint32_t)0x00000200U)         /* Bit[9] */
#define ADC_STS_STR                                     ((uint32_t)0x00000100U)         /* Bit[8] */
#define ADC_STS_AWDG                                    ((uint32_t)0x00000040U)         /* Bit[6] */
#define ADC_STS_ENDCA                                   ((uint32_t)0x00000020U)         /* Bit[5] */
#define ADC_STS_ENDC                                    ((uint32_t)0x00000010U)         /* Bit[4] */
#define ADC_STS_PH4F                                    ((uint32_t)0x00000008U)         /* Bit[3] */
#define ADC_STS_PH3F                                    ((uint32_t)0x00000004U)         /* Bit[2] */
#define ADC_STS_PH2F                                    ((uint32_t)0x00000002U)         /* Bit[1] */
#define ADC_STS_PH1F                                    ((uint32_t)0x00000001U)         /* Bit[0] */

/*** Bit definition for ADC_CTRL1 register  ***/
#define ADC_CTRL1_AWDGIEN                                 ((uint32_t)0x00000040U)         /* Bit[6] */
#define ADC_CTRL1_ENDCAIEN                                ((uint32_t)0x00000020U)         /* Bit[5] */
#define ADC_CTRL1_ENDCIEN                                 ((uint32_t)0x00000010U)         /* Bit[4] */
#define ADC_CTRL1_PH4IEN                                  ((uint32_t)0x00000008U)         /* Bit[3] */
#define ADC_CTRL1_PH3IEN                                  ((uint32_t)0x00000004U)         /* Bit[2] */
#define ADC_CTRL1_PH2IEN                                  ((uint32_t)0x00000002U)         /* Bit[1] */
#define ADC_CTRL1_PH1IEN                                  ((uint32_t)0x00000001U)         /* Bit[0] */

/*** Bit definition for ADC_CTRL2 register  ***/
#define ADC_CTRL2_ALIG                                    ((uint32_t)0x00000004U)         /* Bit[2] */
#define ADC_CTRL2_CTU                                     ((uint32_t)0x00000002U)         /* Bit[1] */
#define ADC_CTRL2_ON                                      ((uint32_t)0x00000001U)         /* Bit[0] */

/*** Bit definition for ADC_CTRL3 register  ***/
#define ADC_CTRL3_TEMPEN                                  ((uint32_t)0x00000020U)         /* Bit[5] */
#define ADC_CTRL3_REFSEL                                  ((uint32_t)0x00000008U)         /* Bit[3] */
#define ADC_CTRL3_VREFEN                                  ((uint32_t)0x00000004U)         /* Bit[2] */

