2zzyyyq/3C/CMSIS/device/n32g033.h
/*** Bit definition for ADC_SAMPT1 register  ***/
#define ADC_SAMPT1_SAMP7                                   ((uint32_t)0xF0000000U)         /* Bit[31:28] */
#define ADC_SAMPT1_SAMP7_0                                 ((uint32_t)0x10000000U)         /* Bit28*/
#define ADC_SAMPT1_SAMP7_1                                 ((uint32_t)0x20000000U)         /* Bit29*/
#define ADC_SAMPT1_SAMP7_2                                 ((uint32_t)0x40000000U)         /* Bit30*/
#define ADC_SAMPT1_SAMP7_3                                 ((uint32_t)0x80000000U)         /* Bit31*/

#define ADC_SAMPT1_SAMP6                                   ((uint32_t)0x0F000000U)         /* Bit[27:24] */
#define ADC_SAMPT1_SAMP6_0                                 ((uint32_t)0x01000000U)         /* Bit24*/
#define ADC_SAMPT1_SAMP6_1                                 ((uint32_t)0x02000000U)         /* Bit25*/
#define ADC_SAMPT1_SAMP6_2                                 ((uint32_t)0x04000000U)         /* Bit26*/
#define ADC_SAMPT1_SAMP6_3                                 ((uint32_t)0x08000000U)         /* Bit27*/

#define ADC_SAMPT1_SAMP5                                   ((uint32_t)0x00F00000U)         /* Bit[23:20] */
#define ADC_SAMPT1_SAMP5_0                                 ((uint32_t)0x00100000U)         /* Bit20*/
#define ADC_SAMPT1_SAMP5_1                                 ((uint32_t)0x00200000U)         /* Bit21*/
#define ADC_SAMPT1_SAMP5_2                                 ((uint32_t)0x00400000U)         /* Bit22*/
#define ADC_SAMPT1_SAMP5_3                                 ((uint32_t)0x00800000U)         /* Bit23*/

#define ADC_SAMPT1_SAMP4                                   ((uint32_t)0x000F0000U)         /* Bit[19:16] */
#define ADC_SAMPT1_SAMP4_0                                 ((uint32_t)0x00010000U)         /* Bit16*/
#define ADC_SAMPT1_SAMP4_1                                 ((uint32_t)0x00020000U)         /* Bit17*/
#define ADC_SAMPT1_SAMP4_2                                 ((uint32_t)0x00040000U)         /* Bit18*/
#define ADC_SAMPT1_SAMP4_3                                 ((uint32_t)0x00080000U)         /* Bit19*/

#define ADC_SAMPT1_SAMP3                                   ((uint32_t)0x0000F000U)         /* Bit[15:12] */
#define ADC_SAMPT1_SAMP3_0                                 ((uint32_t)0x00001000U)         /* Bit12*/
#define ADC_SAMPT1_SAMP3_1                                 ((uint32_t)0x00002000U)         /* Bit13*/
#define ADC_SAMPT1_SAMP3_2                                 ((uint32_t)0x00004000U)         /* Bit14*/
#define ADC_SAMPT1_SAMP3_3                                 ((uint32_t)0x00008000U)         /* Bit15*/

#define ADC_SAMPT1_SAMP2                                   ((uint32_t)0x00000F00U)         /* Bit[11:8] */
#define ADC_SAMPT1_SAMP2_0                                 ((uint32_t)0x00000100U)         /* Bit8*/
#define ADC_SAMPT1_SAMP2_1                                 ((uint32_t)0x00000200U)         /* Bit9*/
#define ADC_SAMPT1_SAMP2_2                                 ((uint32_t)0x00000400U)         /* Bit10*/
#define ADC_SAMPT1_SAMP2_3                                 ((uint32_t)0x00000800U)         /* Bit11*/

#define ADC_SAMPT1_SAMP1                                   ((uint32_t)0x000000F0U)         /* Bit[7:4] */
#define ADC_SAMPT1_SAMP1_0                                 ((uint32_t)0x00000010U)         /* Bit4*/
#define ADC_SAMPT1_SAMP1_1                                 ((uint32_t)0x00000020U)         /* Bit5*/
#define ADC_SAMPT1_SAMP1_2                                 ((uint32_t)0x00000040U)         /* Bit6*/
#define ADC_SAMPT1_SAMP1_3                                 ((uint32_t)0x00000080U)         /* Bit7*/

#define ADC_SAMPT1_SAMP0                                   ((uint32_t)0x0000000FU)         /* Bit[3:0] */
#define ADC_SAMPT1_SAMP0_0                                 ((uint32_t)0x00000001U)         /* Bit0*/
#define ADC_SAMPT1_SAMP0_1                                 ((uint32_t)0x00000002U)         /* Bit1*/
#define ADC_SAMPT1_SAMP0_2                                 ((uint32_t)0x00000004U)         /* Bit2*/
#define ADC_SAMPT1_SAMP0_3                                 ((uint32_t)0x00000008U)         /* Bit3*/


/*** Bit definition for ADC_SAMP2 register  ***/
#define ADC_SAMP2_SAMP15                                  ((uint32_t)0xF0000000U)         /* Bit[31:28] */
#define ADC_SAMP2_SAMP15_0                                ((uint32_t)0x10000000U)         /* Bit28*/
#define ADC_SAMP2_SAMP15_1                                ((uint32_t)0x20000000U)         /* Bit29*/
#define ADC_SAMP2_SAMP15_2                                ((uint32_t)0x40000000U)         /* Bit30*/
#define ADC_SAMP2_SAMP15_3                                ((uint32_t)0x80000000U)         /* Bit31*/

#define ADC_SAMP2_SAMP14                                  ((uint32_t)0x0F000000U)         /* Bit[27:24] */
#define ADC_SAMP2_SAMP14_0                                ((uint32_t)0x01000000U)         /* Bit24*/
#define ADC_SAMP2_SAMP14_1                                ((uint32_t)0x02000000U)         /* Bit25*/
#define ADC_SAMP2_SAMP14_2                                ((uint32_t)0x04000000U)         /* Bit26*/
#define ADC_SAMP2_SAMP14_3                                ((uint32_t)0x08000000U)         /* Bit27*/

#define ADC_SAMP2_SAMP13                                  ((uint32_t)0x00F00000U)         /* Bit[23:20] */
#define ADC_SAMP2_SAMP13_0                                ((uint32_t)0x00100000U)         /* Bit20*/
#define ADC_SAMP2_SAMP13_1                                ((uint32_t)0x00200000U)         /* Bit21*/
#define ADC_SAMP2_SAMP13_2                                ((uint32_t)0x00400000U)         /* Bit22*/
#define ADC_SAMP2_SAMP13_3                                ((uint32_t)0x00800000U)         /* Bit23*/

#define ADC_SAMP2_SAMP12                                  ((uint32_t)0x000F0000U)         /* Bit[19:16] */
#define ADC_SAMP2_SAMP12_0                                ((uint32_t)0x00010000U)         /* Bit16*/
#define ADC_SAMP2_SAMP12_1                                ((uint32_t)0x00020000U)         /* Bit17*/
#define ADC_SAMP2_SAMP12_2                                ((uint32_t)0x00040000U)         /* Bit18*/
#define ADC_SAMP2_SAMP12_3                                ((uint32_t)0x00080000U)         /* Bit19*/

#define ADC_SAMP2_SAMP11                                  ((uint32_t)0x0000F000U)         /* Bit[15:12] */
#define ADC_SAMP2_SAMP11_0                                ((uint32_t)0x00001000U)         /* Bit12*/
#define ADC_SAMP2_SAMP11_1                                ((uint32_t)0x00002000U)         /* Bit13*/
#define ADC_SAMP2_SAMP11_2                                ((uint32_t)0x00004000U)         /* Bit14*/
#define ADC_SAMP2_SAMP11_3                                ((uint32_t)0x00008000U)         /* Bit15*/

#define ADC_SAMP2_SAMP10                                  ((uint32_t)0x00000F00U)         /* Bit[11:8] */
#define ADC_SAMP2_SAMP10_0                                ((uint32_t)0x00000100U)         /* Bit8*/
#define ADC_SAMP2_SAMP10_1                                ((uint32_t)0x00000200U)         /* Bit9*/
#define ADC_SAMP2_SAMP10_2                                ((uint32_t)0x00000400U)         /* Bit10*/
#define ADC_SAMP2_SAMP10_3                                ((uint32_t)0x00000800U)         /* Bit11*/

#define ADC_SAMP2_SAMP9                                   ((uint32_t)0x000000F0U)         /* Bit[7:4] */
#define ADC_SAMP2_SAMP9_0                                 ((uint32_t)0x00000010U)         /* Bit4*/
#define ADC_SAMP2_SAMP9_1                                 ((uint32_t)0x00000020U)         /* Bit5*/
#define ADC_SAMP2_SAMP9_2                                 ((uint32_t)0x00000040U)         /* Bit6*/
#define ADC_SAMP2_SAMP9_3                                 ((uint32_t)0x00000080U)         /* Bit7*/

#define ADC_SAMP2_SAMP8                                   ((uint32_t)0x0000000FU)         /* Bit[3:0] */
#define ADC_SAMP2_SAMP8_0                                 ((uint32_t)0x00000001U)         /* Bit0*/
#define ADC_SAMP2_SAMP8_1                                 ((uint32_t)0x00000002U)         /* Bit1*/
#define ADC_SAMP2_SAMP8_2                                 ((uint32_t)0x00000004U)         /* Bit2*/
#define ADC_SAMP2_SAMP8_3                                 ((uint32_t)0x00000008U)         /* Bit3*/

