2zzyyyq/3C/CMSIS/device/n32g033.h
/*** Bit definition for ADC_AWDHIGH register  ***/
#define ADC_AWDHIGH_HTH                                     ((uint32_t)0x00000FFFU)         /* Bit[11:0] */

/*** Bit definition for ADC_AWDLOW register  ***/
#define ADC_AWDLOW_LTH                                     ((uint32_t)0x00000FFFU)         /* Bit[11:0] */


/*** Bit definition for ADC_AWDEN register  ***/
#define ADC_AWDEN_AWDENx                                  ((uint32_t)0x00003FFFU)         /* Bit[13:0] */
#define ADC_AWDEN_AWDENx_0                                ((uint32_t)0x00000001U)         /* Bit0*/
#define ADC_AWDEN_AWDENx_1                                ((uint32_t)0x00000002U)         /* Bit1*/
#define ADC_AWDEN_AWDENx_2                                ((uint32_t)0x00000004U)         /* Bit2*/
#define ADC_AWDEN_AWDENx_3                                ((uint32_t)0x00000008U)         /* Bit3*/
#define ADC_AWDEN_AWDENx_4                                ((uint32_t)0x00000010U)         /* Bit4*/
#define ADC_AWDEN_AWDENx_5                                ((uint32_t)0x00000020U)         /* Bit5*/
#define ADC_AWDEN_AWDENx_6                                ((uint32_t)0x00000040U)         /* Bit6*/
#define ADC_AWDEN_AWDENx_7                                ((uint32_t)0x00000080U)         /* Bit7*/
#define ADC_AWDEN_AWDENx_8                                ((uint32_t)0x00000100U)         /* Bit8*/
#define ADC_AWDEN_AWDENx_9                                ((uint32_t)0x00000200U)         /* Bit9*/
#define ADC_AWDEN_AWDENx_10                               ((uint32_t)0x00000400U)         /* Bit10*/
#define ADC_AWDEN_AWDENx_11                               ((uint32_t)0x00000800U)         /* Bit11*/
#define ADC_AWDEN_AWDENx_12                               ((uint32_t)0x00001000U)         /* Bit12*/
#define ADC_AWDEN_AWDENx_13                               ((uint32_t)0x00002000U)         /* Bit13*/

/*** Bit definition for ADC_PHCFG register  ***/
#define ADC_PHCFG_TRIGMD                                  ((uint32_t)0x00030000U)         /* Bit[17:16] */
#define ADC_PHCFG_TRIGMD_0                                ((uint32_t)0x00010000U)         /* Bit16*/
#define ADC_PHCFG_TRIGMD_1                                ((uint32_t)0x00020000U)         /* Bit17*/

#define ADC_PHCFG_PH4CHNUM                                ((uint32_t)0x0000F000U)         /* Bit[15:12] */
#define ADC_PHCFG_PH4CHNUM_0                              ((uint32_t)0x00001000U)         /* Bit12*/
#define ADC_PHCFG_PH4CHNUM_1                              ((uint32_t)0x00002000U)         /* Bit13*/
#define ADC_PHCFG_PH4CHNUM_2                              ((uint32_t)0x00004000U)         /* Bit14*/
#define ADC_PHCFG_PH4CHNUM_3                              ((uint32_t)0x00008000U)         /* Bit15*/

#define ADC_PHCFG_PH3CHNUM                                ((uint32_t)0x00000F00U)         /* Bit[11:8] */
#define ADC_PHCFG_PH3CHNUM_0                              ((uint32_t)0x00000100U)         /* Bit8*/
#define ADC_PHCFG_PH3CHNUM_1                              ((uint32_t)0x00000200U)         /* Bit9*/
#define ADC_PHCFG_PH3CHNUM_2                              ((uint32_t)0x00000400U)         /* Bit10*/
#define ADC_PHCFG_PH3CHNUM_3                              ((uint32_t)0x00000800U)         /* Bit11*/

#define ADC_PHCFG_PH2CHNUM                                ((uint32_t)0x000000F0U)         /* Bit[7:4] */
#define ADC_PHCFG_PH2CHNUM_0                              ((uint32_t)0x00000010U)         /* Bit4*/
#define ADC_PHCFG_PH2CHNUM_1                              ((uint32_t)0x00000020U)         /* Bit5*/
#define ADC_PHCFG_PH2CHNUM_2                              ((uint32_t)0x00000040U)         /* Bit6*/
#define ADC_PHCFG_PH2CHNUM_3                              ((uint32_t)0x00000080U)         /* Bit7*/

#define ADC_PHCFG_PH1CHNUM                                ((uint32_t)0x0000000FU)         /* Bit[3:0] */
#define ADC_PHCFG_PH1CHNUM_0                              ((uint32_t)0x00000001U)         /* Bit0*/
#define ADC_PHCFG_PH1CHNUM_1                              ((uint32_t)0x00000002U)         /* Bit1*/
#define ADC_PHCFG_PH1CHNUM_2                              ((uint32_t)0x00000004U)         /* Bit2*/
#define ADC_PHCFG_PH1CHNUM_3                              ((uint32_t)0x00000008U)         /* Bit3*/

/*** Bit definition for ADC_TRIGSEL register  ***/
#define ADC_TRIGSEL_PH4EXTSEL                             ((uint32_t)0xF0000000U)         /* Bit[31:28] */
#define ADC_TRIGSEL_PH4EXTSEL_0                           ((uint32_t)0x10000000U)         /* Bit28*/
#define ADC_TRIGSEL_PH4EXTSEL_1                           ((uint32_t)0x20000000U)         /* Bit29*/
#define ADC_TRIGSEL_PH4EXTSEL_2                           ((uint32_t)0x40000000U)         /* Bit30*/
#define ADC_TRIGSEL_PH4EXTSEL_3                           ((uint32_t)0x80000000U)         /* Bit31*/

#define ADC_TRIGSEL_PH3EXTSEL                             ((uint32_t)0x0F000000U)         /* Bit[27:24] */
#define ADC_TRIGSEL_PH3EXTSEL_0                           ((uint32_t)0x01000000U)         /* Bit24*/
#define ADC_TRIGSEL_PH3EXTSEL_1                           ((uint32_t)0x02000000U)         /* Bit25*/
#define ADC_TRIGSEL_PH3EXTSEL_2                           ((uint32_t)0x04000000U)         /* Bit26*/
#define ADC_TRIGSEL_PH3EXTSEL_3                           ((uint32_t)0x08000000U)         /* Bit27*/

#define ADC_TRIGSEL_PH2EXTSEL                             ((uint32_t)0x00F00000U)         /* Bit[23:20] */
#define ADC_TRIGSEL_PH2EXTSEL_0                           ((uint32_t)0x00100000U)         /* Bit20*/
#define ADC_TRIGSEL_PH2EXTSEL_1                           ((uint32_t)0x00200000U)         /* Bit21*/
#define ADC_TRIGSEL_PH2EXTSEL_2                           ((uint32_t)0x00400000U)         /* Bit22*/
#define ADC_TRIGSEL_PH2EXTSEL_3                           ((uint32_t)0x00800000U)         /* Bit23*/

#define ADC_TRIGSEL_PH1EXTSEL                             ((uint32_t)0x000F0000U)         /* Bit[19:16] */
#define ADC_TRIGSEL_PH1EXTSEL_0                           ((uint32_t)0x00010000U)         /* Bit16*/
#define ADC_TRIGSEL_PH1EXTSEL_1                           ((uint32_t)0x00020000U)         /* Bit17*/
#define ADC_TRIGSEL_PH1EXTSEL_2                           ((uint32_t)0x00040000U)         /* Bit18*/
#define ADC_TRIGSEL_PH1EXTSEL_3                           ((uint32_t)0x00080000U)         /* Bit19*/

