2zzyyyq/3C/CMSIS/device/n32g033.h
#define ADC_TRIGSEL_SWEN                                  ((uint32_t)0x00008000U)         /* Bit[15] */
#define ADC_TRIGSEL_EXTILINEEN                            ((uint32_t)0x00004000U)         /* Bit[14] */
#define ADC_TRIGSEL_TIM4_TRGOEN                           ((uint32_t)0x00002000U)         /* Bit[13] */
#define ADC_TRIGSEL_TIM4_CC2EN                            ((uint32_t)0x00001000U)         /* Bit[12] */
#define ADC_TRIGSEL_TIM4_CC1EN                            ((uint32_t)0x00000800U)         /* Bit[11] */
#define ADC_TRIGSEL_TIM3_TRGOEN                           ((uint32_t)0x00000400U)         /* Bit[10] */
#define ADC_TRIGSEL_TIM3_CC2EN                            ((uint32_t)0x00000200U)         /* Bit[9] */
#define ADC_TRIGSEL_TIM3_CC1EN                            ((uint32_t)0x00000100U)         /* Bit[8] */
#define ADC_TRIGSEL_TIM1_TRGOEN                           ((uint32_t)0x00000080U)         /* Bit[7] */
#define ADC_TRIGSEL_TIM1_CC7EN                            ((uint32_t)0x00000040U)         /* Bit[6] */
#define ADC_TRIGSEL_TIM1_CC6EN                            ((uint32_t)0x00000020U)         /* Bit[5] */
#define ADC_TRIGSEL_TIM1_CC5EN                            ((uint32_t)0x00000010U)         /* Bit[4] */
#define ADC_TRIGSEL_TIM1_CC4EN                            ((uint32_t)0x00000008U)         /* Bit[3] */
#define ADC_TRIGSEL_TIM1_CC3EN                            ((uint32_t)0x00000004U)         /* Bit[2] */
#define ADC_TRIGSEL_TIM1_CC2EN                            ((uint32_t)0x00000002U)         /* Bit[1] */
#define ADC_TRIGSEL_TIM1_CC1EN                            ((uint32_t)0x00000001U)         /* Bit[0] */

/*** Bit definition for ADC_PHSWTRIG register  ***/
#define ADC_PHSWTRIG_PHSWSTART                            ((uint32_t)0x0000FFFFU)         /* Bit[15:0] */

/*** Bit definition for ADC_SEQ1 register  ***/
#define ADC_SEQ1_SEQ8                                    ((uint32_t)0xF0000000U)         /* Bit[31:28] */
#define ADC_SEQ1_SEQ8_0                                  ((uint32_t)0x10000000U)         /* Bit28*/
#define ADC_SEQ1_SEQ8_1                                  ((uint32_t)0x20000000U)         /* Bit29*/
#define ADC_SEQ1_SEQ8_2                                  ((uint32_t)0x40000000U)         /* Bit30*/
#define ADC_SEQ1_SEQ8_3                                  ((uint32_t)0x80000000U)         /* Bit31*/

#define ADC_SEQ1_SEQ7                                    ((uint32_t)0x0F000000U)         /* Bit[27:24] */
#define ADC_SEQ1_SEQ7_0                                  ((uint32_t)0x01000000U)         /* Bit24*/
#define ADC_SEQ1_SEQ7_1                                  ((uint32_t)0x02000000U)         /* Bit25*/
#define ADC_SEQ1_SEQ7_2                                  ((uint32_t)0x04000000U)         /* Bit26*/
#define ADC_SEQ1_SEQ7_3                                  ((uint32_t)0x08000000U)         /* Bit27*/

#define ADC_SEQ1_SEQ6                                    ((uint32_t)0x00F00000U)         /* Bit[23:20] */
#define ADC_SEQ1_SEQ6_0                                  ((uint32_t)0x00100000U)         /* Bit20*/
#define ADC_SEQ1_SEQ6_1                                  ((uint32_t)0x00200000U)         /* Bit21*/
#define ADC_SEQ1_SEQ6_2                                  ((uint32_t)0x00400000U)         /* Bit22*/
#define ADC_SEQ1_SEQ6_3                                  ((uint32_t)0x00800000U)         /* Bit23*/

#define ADC_SEQ1_SEQ5                                    ((uint32_t)0x000F0000U)         /* Bit[19:16] */
#define ADC_SEQ1_SEQ5_0                                  ((uint32_t)0x00010000U)         /* Bit16*/
#define ADC_SEQ1_SEQ5_1                                  ((uint32_t)0x00020000U)         /* Bit17*/
#define ADC_SEQ1_SEQ5_2                                  ((uint32_t)0x00040000U)         /* Bit18*/
#define ADC_SEQ1_SEQ5_3                                  ((uint32_t)0x00080000U)         /* Bit19*/

#define ADC_SEQ1_SEQ4                                    ((uint32_t)0x0000F000U)         /* Bit[15:12] */
#define ADC_SEQ1_SEQ4_0                                  ((uint32_t)0x00001000U)         /* Bit12*/
#define ADC_SEQ1_SEQ4_1                                  ((uint32_t)0x00002000U)         /* Bit13*/
#define ADC_SEQ1_SEQ4_2                                  ((uint32_t)0x00004000U)         /* Bit14*/
#define ADC_SEQ1_SEQ4_3                                  ((uint32_t)0x00008000U)         /* Bit15*/

#define ADC_SEQ1_SEQ3                                    ((uint32_t)0x00000F00U)         /* Bit[11:8] */
#define ADC_SEQ1_SEQ3_0                                  ((uint32_t)0x00000100U)         /* Bit8*/
#define ADC_SEQ1_SEQ3_1                                  ((uint32_t)0x00000200U)         /* Bit9*/
#define ADC_SEQ1_SEQ3_2                                  ((uint32_t)0x00000400U)         /* Bit10*/
#define ADC_SEQ1_SEQ3_3                                  ((uint32_t)0x00000800U)         /* Bit11*/

#define ADC_SEQ1_SEQ2                                    ((uint32_t)0x000000F0U)         /* Bit[7:4] */
#define ADC_SEQ1_SEQ2_0                                  ((uint32_t)0x00000010U)         /* Bit4*/
#define ADC_SEQ1_SEQ2_1                                  ((uint32_t)0x00000020U)         /* Bit5*/
#define ADC_SEQ1_SEQ2_2                                  ((uint32_t)0x00000040U)         /* Bit6*/
#define ADC_SEQ1_SEQ2_3                                  ((uint32_t)0x00000080U)         /* Bit7*/

#define ADC_SEQ1_SEQ1                                    ((uint32_t)0x0000000FU)         /* Bit[3:0] */
#define ADC_SEQ1_SEQ1_0                                  ((uint32_t)0x00000001U)         /* Bit0*/
#define ADC_SEQ1_SEQ1_1                                  ((uint32_t)0x00000002U)         /* Bit1*/
#define ADC_SEQ1_SEQ1_2                                  ((uint32_t)0x00000004U)         /* Bit2*/
#define ADC_SEQ1_SEQ1_3                                  ((uint32_t)0x00000008U)         /* Bit3*/

/*** Bit definition for ADC_SEQ2 register  ***/
#define ADC_SEQ2_SEQ10                                   ((uint32_t)0x000000F0U)         /* Bit[7:4] */
#define ADC_SEQ2_SEQ10_0                                 ((uint32_t)0x00000010U)         /* Bit4*/
#define ADC_SEQ2_SEQ10_1                                 ((uint32_t)0x00000020U)         /* Bit5*/
#define ADC_SEQ2_SEQ10_2                                 ((uint32_t)0x00000040U)         /* Bit6*/
#define ADC_SEQ2_SEQ10_3                                 ((uint32_t)0x00000080U)         /* Bit7*/

#define ADC_SEQ2_SEQ9                                    ((uint32_t)0x0000000FU)         /* Bit[3:0] */
#define ADC_SEQ2_SEQ9_0                                  ((uint32_t)0x00000001U)         /* Bit0*/
#define ADC_SEQ2_SEQ9_1                                  ((uint32_t)0x00000002U)         /* Bit1*/
#define ADC_SEQ2_SEQ9_2                                  ((uint32_t)0x00000004U)         /* Bit2*/
#define ADC_SEQ2_SEQ9_3                                  ((uint32_t)0x00000008U)         /* Bit3*/

/*** Bit definition for ADC_DAT0 register  ***/
#define ADC_DAT0_DAT0                                    ((uint32_t)0x0000FFFFU)         /* Bit[15:0] */

/*** Bit definition for ADC_DAT1 register  ***/
#define ADC_DAT1_DAT1                                    ((uint32_t)0x0000FFFFU)         /* Bit[15:0] */

