2zzyyyq/3C/CMSIS/device/n32g033.h
/*** Bit definition for ADC_DAT2 register  ***/
#define ADC_DAT2_DAT2                                    ((uint32_t)0x0000FFFFU)         /* Bit[15:0] */

/*** Bit definition for ADC_DAT3 register  ***/
#define ADC_DAT3_DAT3                                    ((uint32_t)0x0000FFFFU)         /* Bit[15:0] */

/*** Bit definition for ADC_DAT4 register  ***/
#define ADC_DAT4_DAT4                                    ((uint32_t)0x0000FFFFU)         /* Bit[15:0] */

/*** Bit definition for ADC_DAT5 register  ***/
#define ADC_DAT5_DAT5                                    ((uint32_t)0x0000FFFFU)         /* Bit[15:0] */

/*** Bit definition for ADC_DAT6 register  ***/
#define ADC_DAT6_DAT6                                    ((uint32_t)0x0000FFFFU)         /* Bit[15:0] */

/*** Bit definition for ADC_DAT7 register  ***/
#define ADC_DAT7_DAT7                                    ((uint32_t)0x0000FFFFU)         /* Bit[15:0] */

/*** Bit definition for ADC_DAT8 register  ***/
#define ADC_DAT8_DAT8                                    ((uint32_t)0x0000FFFFU)         /* Bit[15:0] */

/*** Bit definition for ADC_DAT9 register  ***/
#define ADC_DAT9_DAT9                                    ((uint32_t)0x0000FFFFU)         /* Bit[15:0] */

/***  Optical Preamplifier Amplifier Peripheral Interface ***/

/*** Bit definition for OPAMP1_CS register  ***/
#define OPAMP1_CS_OUTSEL                               ((uint32_t)0x00008000U) /* OPA1 OUTSEL */

#define OPAMP1_CS_VMSEL                                ((uint32_t)0x00007000U) /* OPA1 VMSEL */
#define OPAMP1_CS_VMSEL_0                              ((uint32_t)0x00001000U) /* Bit0 */
#define OPAMP1_CS_VMSEL_1                              ((uint32_t)0x00002000U) /* Bit1 */
#define OPAMP1_CS_VMSEL_2                              ((uint32_t)0x00004000U) /* Bit2 */

#define OPAMP1_CS_VPSEL                                ((uint32_t)0x00000700U) /* OPA1 VPSEL */
#define OPAMP1_CS_VPSEL_0                              ((uint32_t)0x00000100U) /* Bit0 */
#define OPAMP1_CS_VPSEL_1                              ((uint32_t)0x00000200U) /* Bit1 */
#define OPAMP1_CS_VPSEL_2                              ((uint32_t)0x00000400U) /* Bit2 */

#define OPAMP1_CS_GAIN                                 ((uint32_t)0x00000038U) /* OPA1 GAIN */
#define OPAMP1_CS_GAIN_0                               ((uint32_t)0x00000008U) /* Bit0 */
#define OPAMP1_CS_GAIN_1                               ((uint32_t)0x00000010U) /* Bit1 */
#define OPAMP1_CS_GAIN_2                               ((uint32_t)0x00000020U) /* Bit2 */

#define OPAMP1_CS_MOD                                  ((uint32_t)0x00000006U) /* OPA1 Mode */
#define OPAMP1_CS_MOD_0                                ((uint32_t)0x00000002U) /* Bit0 */
#define OPAMP1_CS_MOD_1                                ((uint32_t)0x00000004U) /* Bit1 */

#define OPAMP1_CS_EN                                   ((uint32_t)0x00000001U) /* OPA1 Enable */

/**  Bit definition for OPAMP2_CS register  ***/
#define OPAMP2_CS_GAIN                                 ((uint32_t)0x00000038U) /* OPA2 GAIN */
#define OPAMP2_CS_GAIN_0                               ((uint32_t)0x00000008U) /* Bit0 */
#define OPAMP2_CS_GAIN_1                               ((uint32_t)0x00000010U) /* Bit1 */
#define OPAMP2_CS_GAIN_2                               ((uint32_t)0x00000020U) /* Bit2 */

#define OPAMP2_CS_MOD                                  ((uint32_t)0x00000002U) /* OPA2 Mode */

#define OPAMP2_CS_EN                                   ((uint32_t)0x00000001U) /* OPA2 Enable */
/**  Bit definition for OPAMP3_CS register  ***/
#define OPAMP3_CS_GAIN                                 ((uint32_t)0x00000038U) /* OPA3 GAIN */
#define OPAMP3_CS_GAIN_0                               ((uint32_t)0x00000008U) /* Bit0 */
#define OPAMP3_CS_GAIN_1                               ((uint32_t)0x00000010U) /* Bit1 */
#define OPAMP3_CS_GAIN_2                               ((uint32_t)0x00000020U) /* Bit2 */

#define OPAMP3_CS_MOD                                  ((uint32_t)0x00000002U) /* OPA3 Mode */

#define OPAMP3_CS_EN                                   ((uint32_t)0x00000001U) /* OPA3 Enable */

/**  Bit definition for OPAMP_LOCK register  ***/

#define OPAMP_LOCK                                     ((uint32_t)0x00000001U) /* OPAMP1/2/3 LK */

/**  Bit definition for OPAMP_VREFSEL register  ***/
#define OPAMP1_VREFSEL_SEL                             ((uint32_t)0x00000003U) /* OPAMP1 SEL */
#define OPAMP1_VREFSEL_SEL_0                           ((uint32_t)0x00000001U) /* Bit0 */
#define OPAMP1_VREFSEL_SEL_1                           ((uint32_t)0x00000002U) /* Bit1 */

#define OPAMP2_VREFSEL_SEL                             ((uint32_t)0x0000000CU) /* OPAMP2 SEL */
#define OPAMP2_VREFSEL_SEL_0                           ((uint32_t)0x00000004U) /* Bit0 */
#define OPAMP2_VREFSEL_SEL_1                           ((uint32_t)0x00000008U) /* Bit1 */

#define OPAMP3_VREFSEL_SEL                             ((uint32_t)0x00000030U) /* OPAMP3 SEL */
#define OPAMP3_VREFSEL_SEL_0                           ((uint32_t)0x00000010U) /* Bit0 */
#define OPAMP3_VREFSEL_SEL_1                           ((uint32_t)0x00000020U) /* Bit1 */



/***   TIM  ***/

/** Bit definition for TIM_CTRL1 register  **/
#define TIM_CTRL1_CNTEN                         ((uint32_t)0x00000001U) /* Counter enable */
#define TIM_CTRL1_DIR                           ((uint32_t)0x00000002U) /* Direction */

#define TIM_CTRL1_CAMSEL                        ((uint32_t)0x0000000CU) /* CMS[1:0] bits (Center-aligned mode selection) */
#define TIM_CTRL1_CAMSEL_0                      ((uint32_t)0x00000004U) /* Bit 0 */
#define TIM_CTRL1_CAMSEL_1                      ((uint32_t)0x00000008U) /* Bit 1 */

#define TIM_CTRL1_UPRS                          ((uint32_t)0x00000010U) /* Update request source */
#define TIM_CTRL1_UPDIS                         ((uint32_t)0x00000020U) /* Update disable */

#define TIM_CTRL1_CLKD                          ((uint32_t)0x000000C0U) /* CKD[1:0] bits (clock division) */
#define TIM_CTRL1_CLKD_0                        ((uint32_t)0x00000040U) /* Bit 0 */
#define TIM_CTRL1_CLKD_1                        ((uint32_t)0x00000080U) /* Bit 1 */

#define TIM_CTRL1_ONEPM                         ((uint32_t)0x00000100U) /* One pulse mode */
#define TIM_CTRL1_ARPEN                         ((uint32_t)0x00000200U) /* Auto-reload preload enable */
#define TIM_CTRL1_LBKPEN                        ((uint32_t)0x00000400U) /* LOCKUP as bkp Enable*/
#define TIM_CTRL1_PBKPEN                        ((uint32_t)0x00000800U) /* PVD as bkp Enable */
#define TIM_CTRL1_CLRSEL                        ((uint32_t)0x00002000U) /* OCxRef clear selection */

#define TIM_CTRL1_C1SEL                         ((uint32_t)0x00010000U) /* Channel 1 selection */


#define TIM_CTRL1_ASMMETRIC                     ((uint32_t)0x00800000U)  /* Asynmmetric mode enable in center-aligned */
#define TIM_CTRL1_TRGLDCNTEN                    ((uint32_t)0x10000000U)  /* Trgi reset CNT enable */

/** Bit definition for TIM_CTRL2 register **/
#define TIM_CTRL2_OI1                           ((uint32_t)0x00000001U) /* Output Idle state 1 (OC1 output) */
#define TIM_CTRL2_OI1N                          ((uint32_t)0x00000002U) /* Output Idle state 1 (OC1N output) */
#define TIM_CTRL2_OI2                           ((uint32_t)0x00000004U) /* Output Idle state 2 (OC2 output) */
#define TIM_CTRL2_OI2N                          ((uint32_t)0x00000008U) /* Output Idle state 2 (OC2N output) */
#define TIM_CTRL2_OI3                           ((uint32_t)0x00000010U) /* Output Idle state 3 (OC3 output) */
#define TIM_CTRL2_OI3N                          ((uint32_t)0x00000020U) /* Output Idle state 3 (OC3N output) */
#define TIM_CTRL2_OI4                           ((uint32_t)0x00000040U) /* Output Idle state 4 (OC4 output) */
#define TIM_CTRL2_OI4N                          ((uint32_t)0x00000080U) /* Output Idle state 4 (OC4N output) */


