2zzyyyq/3C/CMSIS/device/n32g033.h
/** Bit definition for TIM_FILTO register **/
#define TIM_FILTO_C1FILTO                       ((uint32_t)0x00000001U) /* CH1 filter output state */
#define TIM_FILTO_C2FILTO                       ((uint32_t)0x00000002U) /* CH2 filter output state */
#define TIM_FILTO_C3FILTO                       ((uint32_t)0x00000004U) /* CH3 filter output state */

/** Bit definition for TIM_AF1 register **/
#define TIM_AF1_IOM1BRKEN                       ((uint32_t)0x00000001U) /* Enable IOM1 as break1 input */
#define TIM_AF1_COMP1BRKEN                      ((uint32_t)0x00000002U) /* Enable COMP1 as break1 input */
#define TIM_AF1_IOM1BRKP                        ((uint32_t)0x00000200U) /* Select polarity of break1 input from IOM1 */
#define TIM_AF1_COMP1BRKP                       ((uint32_t)0x00000400U) /* Select polarity of break1 input from COMP1 */
#define TIM_AF1_IOM2BRKEN                       ((uint32_t)0x00010000U) /* Enable IOM2 as break1 input */
#define TIM_AF1_IOM3BRKEN                       ((uint32_t)0x00020000U) /* Enable IOM3 as break1 input */
#define TIM_AF1_IOM4BRKEN                       ((uint32_t)0x00040000U) /* Enable IOM4 as break1 input */
#define TIM_AF1_IOM2BRKP                        ((uint32_t)0x00080000U) /* Select polarity of break1 input from IOM2 */
#define TIM_AF1_IOM3BRKP                        ((uint32_t)0x00100000U) /* Select polarity of break1 input from IOM3 */
#define TIM_AF1_IOM4BRKP                        ((uint32_t)0x00200000U) /* Select polarity of break1 input from IOM4 */

/** Bit definition for TIM_ENCDAT register **/
#define TIM_ENCDAT_ENCDAT                       ((uint32_t)0xFFFFFFFFU) /*  */


/** Bit definition for TIM_ENCMCTRL register **/
#define TIM_ENCMCTRL_C3LDCNTEN                   ((uint32_t)0x00000001U) /*  */

#define TIM_ENCMCTRL_C3LDCNTSEL                  ((uint32_t)0x00000006U) /*  */
#define TIM_ENCMCTRL_C3LDCNTSEL_0                ((uint32_t)0x00000002U) /*  */
#define TIM_ENCMCTRL_C3LDCNTSEL_1                ((uint32_t)0x00000004U) /*  */

#define TIM_ENCMCTRL_ENCMD                       ((uint32_t)0x00000078U) /*  */
#define TIM_ENCMCTRL_ENCMD_0                     ((uint32_t)0x00000008U) /*  */
#define TIM_ENCMCTRL_ENCMD_1                     ((uint32_t)0x00000010U) /*  */
#define TIM_ENCMCTRL_ENCMD_2                     ((uint32_t)0x00000020U) /*  */
#define TIM_ENCMCTRL_ENCMD_3                     ((uint32_t)0x00000040U) /*  */

#define TIM_ENCMCTRL_ENCDATS                     ((uint32_t)0x80000000U) /*  */


/** Bit definition for TIM_ENCMCTRL register **/
#define TIM_ENCLVR_LVR                            ((uint32_t)0xFFFFFFFFU) /*  */


/** Bit definition for TIM_DCTRL register **/
#define TIM_DCTRL_DBADDR                        ((uint32_t)0x00003F00U) /* DBA[5:0] bits (DMA Base Address) */
#define TIM_DCTRL_DBADDR_0                      ((uint32_t)0x00000100U) /* Bit 0 */
#define TIM_DCTRL_DBADDR_1                      ((uint32_t)0x00000200U) /* Bit 1 */
#define TIM_DCTRL_DBADDR_2                      ((uint32_t)0x00000400U) /* Bit 2 */
#define TIM_DCTRL_DBADDR_3                      ((uint32_t)0x00000800U) /* Bit 3 */
#define TIM_DCTRL_DBADDR_4                      ((uint32_t)0x00001000U) /* Bit 4 */
#define TIM_DCTRL_DBADDR_5                      ((uint32_t)0x00002000U) /* Bit 5 */

#define TIM_DCTRL_DBLEN                         ((uint32_t)0x0000003FU) /* DBL[5:0] bits (DMA Burst Length) */
#define TIM_DCTRL_DBLEN_0                       ((uint32_t)0x00000001U) /* Bit 0 */
#define TIM_DCTRL_DBLEN_1                       ((uint32_t)0x00000002U) /* Bit 1 */
#define TIM_DCTRL_DBLEN_2                       ((uint32_t)0x00000004U) /* Bit 2 */
#define TIM_DCTRL_DBLEN_3                       ((uint32_t)0x00000008U) /* Bit 3 */
#define TIM_DCTRL_DBLEN_4                       ((uint32_t)0x00000010U) /* Bit 4 */
#define TIM_DCTRL_DBLEN_5                       ((uint32_t)0x00000020U) /* Bit 5 */

/** Bit definition for TIM_DADDR register **/
#define TIM_DADDR_BURST                         ((uint32_t)0xFFFFFFFFU) /* DMA register for burst accesses */

/******************************************************************************/
/*                                                                            */
/*                           Independent WATCHDOG                             */
/*                                                                            */
/******************************************************************************/

/** Bit definition for IWDG_KEY register **/
#define IWDG_KEY_KEYV     ((uint16_t)0xFFFFU) /* Key value (write only, read 0000h) */

/** Bit definition for IWDG_STS register **/
#define IWDG_STS_PVU      ((uint8_t)0x01U)    /* Watchdog prescaler value update */
#define IWDG_STS_CRVU     ((uint8_t)0x02U)    /* Watchdog counter reload value update */

/** Bit definition for IWDG_PREDIV register **/
#define IWDG_PREDIV_PD    ((uint8_t)0x07U)    /* PD[2:0] (Prescaler divider) */
#define IWDG_PREDIV_PD0   ((uint8_t)0x01U)    /* Bit 0 */
#define IWDG_PREDIV_PD1   ((uint8_t)0x02U)    /* Bit 1 */
#define IWDG_PREDIV_PD2   ((uint8_t)0x04U)    /* Bit 2 */

/** Bit definition for IWDG_RELV register **/
#define IWDG_RELV_REL     ((uint16_t)0x3FFFU) /* Watchdog counter reload value */

/** Bit definition for IWDG_CTRL register **/
#define IWDG_CRTL_ITE     ((uint32_t)0x01U) /* Watchdog counter Interrupt */


/*                                                                            */
/*                        Comparators Peripheral Interface                         */
/*                                                                            */
/******************************************************************************/

/******** Bit definition for COMP_INTEN register  ********/
#define COMP_INTEN_CMPIEN                                 ((uint32_t)0x00000001U)         /* Bit[0] */

/******** Bit definition for COMP_INTSTS register  ********/
#define COMP_INTSTS_CMPIS                                 ((uint32_t)0x00000001U)         /* Bit[0] */

