2zzyyyq/3C/CMSIS/device/n32g033.h
/******** Bit definition for COMP_LOCK register  ********/
#define COMP_LOCK_CMPLK                                   ((uint32_t)0x00000001U)         /* Bit[0] */

/******** Bit definition for COMP_CTRL register  ********/
#define COMP_CTRL_CLKSEL                                  ((uint32_t)0x00100000U)         /* Bit[20] */
#define COMP_CTRL_PWRMD                                   ((uint32_t)0x00080000U)         /* Bit[19] */
#define COMP_CTRL_OUT                                     ((uint32_t)0x00020000U)         /* Bit[17] */
#define COMP_CTRL_BLKING                                  ((uint32_t)0x00004000U)         /* Bit[14] */

#define COMP_CTRL_HYST                                    ((uint32_t)0x00003000U)         /* Bit[13:12] */
#define COMP_CTRL_HYST_0                                  ((uint32_t)0x00001000U)         /* Bit12*/
#define COMP_CTRL_HYST_1                                  ((uint32_t)0x00002000U)         /* Bit13*/
#define COMP_CTRL_POL                                     ((uint32_t)0x00000800U)         /* Bit[11] */

#define COMP_CTRL_INPSEL                                  ((uint32_t)0x000000F0U)         /* Bit[7:4] */
#define COMP_CTRL_INPSEL_0                                ((uint32_t)0x00000010U)         /* Bit4*/
#define COMP_CTRL_INPSEL_1                                ((uint32_t)0x00000020U)         /* Bit5*/
#define COMP_CTRL_INPSEL_2                                ((uint32_t)0x00000040U)         /* Bit6*/
#define COMP_CTRL_INPSEL_3                                ((uint32_t)0x00000080U)         /* Bit7*/

#define COMP_CTRL_INMSEL                                  ((uint32_t)0x0000000EU)         /* Bit[3:1] */
#define COMP_CTRL_INMSEL_0                                ((uint32_t)0x00000002U)         /* Bit1*/
#define COMP_CTRL_INMSEL_1                                ((uint32_t)0x00000004U)         /* Bit2*/
#define COMP_CTRL_INMSEL_2                                ((uint32_t)0x00000008U)         /* Bit3*/

#define COMP_CTRL_EN                                      ((uint32_t)0x00000001U)         /* Bit[0] */

/******** Bit definition for COMP_FILC register  ********/
#define COMP_FILC_SAMPW                                   ((uint32_t)0x000007C0U)         /* Bit[10:6] */

#define COMP_FILC_THRESH                                  ((uint32_t)0x0000003EU)         /* Bit[5:1] */

#define COMP_FILC_FILEN                                   ((uint32_t)0x00000001U)         /* Bit[0] */

/******** Bit definition for COMP_FILP register  ********/
#define COMP_FILP_CLKPSC                                  ((uint32_t)0x0000FFFFU)         /* Bit[15:0] */

/******** Bit definition for COMP_INVREF register  ********/
#define COMP_INVREF_VREFSEL                               ((uint32_t)0x000001FEU)         /* Bit[8:1] */

#define COMP_INVREF_VREFEN                                ((uint32_t)0x00000001U)         /* Bit[0] */


/*** Serial Peripheral Interface ***/

/** Bit definition for SPI_CTRL1 register **/
#define SPI_CTRL1_BR        ((uint16_t)0x0007U)      /* BR[2:0] bits (Baud Rate Control) */
#define SPI_CTRL1_BR0       ((uint16_t)0x0001U)      /* Bit 0 */
#define SPI_CTRL1_BR1       ((uint16_t)0x0002U)      /* Bit 1 */
#define SPI_CTRL1_BR2       ((uint16_t)0x0004U)      /* Bit 2 */
#define SPI_CTRL1_CLKPOL    ((uint16_t)0x0010U)      /* Clock Polarity */
#define SPI_CTRL1_CLKPHA    ((uint16_t)0x0020U)      /* Clock Phase */
#define SPI_CTRL1_MSEL      ((uint16_t)0x0040U)      /* Master Selection */
#define SPI_CTRL1_LSBFF     ((uint16_t)0x0080U)      /* Frame Format */
#define SPI_CTRL1_DATFF     ((uint16_t)0x0100U)      /* Data Frame Format */
#define SPI_CTRL1_CRCNEXT   ((uint16_t)0x0200U)      /* Transmit CRC next */
#define SPI_CTRL1_SSOEN     ((uint16_t)0x0400U)      /* SS Output Enable */
#define SPI_CTRL1_SSEL      ((uint16_t)0x0800U)      /* Internal slave select */
#define SPI_CTRL1_SSMEN     ((uint16_t)0x1000U)      /* Software slave management */
#define SPI_CTRL1_RONLY     ((uint16_t)0x2000U)      /* Receive only */
#define SPI_CTRL1_BIDIROEN  ((uint16_t)0x4000U)      /* Output enable in bidirectional mode */
#define SPI_CTRL1_BIDIRMODE ((uint16_t)0x8000U)      /* Bidirectional data mode enable */

/** Bit definition for SPI_CTRL2 register **/ 
#define SPI_CTRL2_SPIEN     ((uint16_t)0x0001U)      /* SPI Enable */
#define SPI_CTRL2_RDMAEN    ((uint16_t)0x0002U)      /* Rx buffer DMA enable */
#define SPI_CTRL2_TDMAEN    ((uint16_t)0x0004U)      /* Tx buffer DMA enable */
#define SPI_CTRL2_CRCEN     ((uint16_t)0x0008U)      /* Hardware CRC calculation enable */
#define SPI_CTRL2_TEINTEN   ((uint16_t)0x0010U)      /* Tx buffer Empty Interrupt Enable */
#define SPI_CTRL2_RNEINTEN  ((uint16_t)0x0020U)      /* RX buffer Not Empty Interrupt Enable */
#define SPI_CTRL2_ERRINTEN  ((uint16_t)0x0040U)      /* Error Interrupt Enable */
#define SPI_CTRL2_NSSPOL    ((uint16_t)0x0080U)      /* NSS polarity */
#define SPI_CTRL2_CRCSTP    ((uint16_t)0x2000U)      /* CRC stop calculation control */

/** Bit definition for SPI_STS register **/
#define SPI_STS_TE          ((uint16_t)0x0001U)      /* Transmit buffer Empty */
#define SPI_STS_RNE         ((uint16_t)0x0002U)      /* Receive buffer Not Empty */
#define SPI_STS_BUSY        ((uint16_t)0x0004U)      /* Busy flag */
#define SPI_STS_CRCERR      ((uint16_t)0x0008U)      /* CRC fault */
#define SPI_STS_MODERR      ((uint16_t)0x0010U)      /* Mode fault */
#define SPI_STS_OVER        ((uint16_t)0x0020U)      /* Overrun flag */

/** Bit definition for SPI_DAT register **/
#define SPI_DAT_DAT         ((uint16_t)0xFFFFU)      /* Data Register */

/** Bit definition for SPI_CRCTDAT register **/
#define SPI_CRCTDAT_DAT     ((uint16_t)0xFFFFU)      /* The CRC result value to send */

/** Bit definition for SPI_CRCRDAT register **/
#define SPI_CRCRDAT_DAT     ((uint16_t)0xFFFFU)      /* The received CRC result value */

/** Bit definition for SPI_CRCPOLY register **/
#define SPI_CRCPOLY_DAT     ((uint16_t)0xFFFFU)      /* CRC polynomial */

