2zzyyyq/3C/CMSIS/device/n32g033.h
/**  Bit definition for I2C_GFLTRCTRL register  ***/
#define  I2C_GFLTRCTRL_SDADFW   ((uint16_t)0x000FU) /* SDA digital gfilter width selection */
#define  I2C_GFLTRCTRL_SCLDFW   ((uint16_t)0x00F0U) /* SCL digital gfilter width selection */

#define  I2C_GFLTRCTRL_SDAAFW   ((uint16_t)0x0300U) /* SDA analog gfilter width selection */
#define  I2C_GFLTRCTRL_SDAAFW_0 ((uint16_t)0x0100U) /* Bit 0 */
#define  I2C_GFLTRCTRL_SDAAFW_1 ((uint16_t)0x0200U) /* Bit 1 */

#define  I2C_GFLTRCTRL_SDAAFENN ((uint16_t)0x0800U) /* SDA analog gfilter enable */

#define  I2C_GFLTRCTRL_SCLAFW   ((uint16_t)0x3000U) /* SCL analog gfilter width selection */
#define  I2C_GFLTRCTRL_SCLAFW_0 ((uint16_t)0x1000U) /* Bit 0 */
#define  I2C_GFLTRCTRL_SCLAFW_1 ((uint16_t)0x2000U) /* Bit 1 */

#define  I2C_GFLTRCTRL_SCLAFENN ((uint16_t)0x8000U) /* SCL analog gfilter enable */

/*** Universal Synchronous Asynchronous Receiver Transmitter ***/

/** Bit definition for UART_CTRL1 register **/
#define UART_CTRL1_UEN         ((uint32_t)0x00000001U) /* UART Enable */
#define UART_CTRL1_RXEN        ((uint32_t)0x00000002U) /* Receiver Enable */
#define UART_CTRL1_TXEN        ((uint32_t)0x00000004U) /* Transmitter Enable */
#define UART_CTRL1_PSEL        ((uint32_t)0x00000008U) /* Parity Selection */
#define UART_CTRL1_PCEN        ((uint32_t)0x00000010U) /* Parity Control Enable */
#define UART_CTRL1_WL          ((uint32_t)0x00000020U) /* Word length */
#define UART_CTRL1_RCVWU       ((uint32_t)0x00000040U) /* Receiver wakeup */
#define UART_CTRL1_WUM         ((uint32_t)0x00000080U) /* Wakeup method */
#define UART_CTRL1_IDLEIEN     ((uint32_t)0x00000100U) /* IDLE Interrupt Enable */
#define UART_CTRL1_RXDNEIEN    ((uint32_t)0x00000200U) /* RXNE Interrupt Enable */
#define UART_CTRL1_TXDEIEN     ((uint32_t)0x00000400U) /* PE Interrupt Enable */
#define UART_CTRL1_TXCIEN      ((uint32_t)0x00000800U) /* Transmission Complete Interrupt Enable */
#define UART_CTRL1_PEIEN       ((uint32_t)0x00001000U) /* PE Interrupt Enable */
#define UART_CTRL1_SDBRK       ((uint32_t)0x00002000U) /* Send Break */
#define UART_CTRL1_DEM         ((uint32_t)0x00004000U) /* Driver enable mode */
#define UART_CTRL1_DEP         ((uint32_t)0x00008000U) /* Driver enable polarity selection */
#define UART_CTRL1_DEDT_MASK   ((uint32_t)0x001F0000U) /* Driver Enable deassertion time mask */
#define UART_CTRL1_DEAT_MASK   ((uint32_t)0x03E00000U) /* Driver Enable assertion time mask */
#define UART_CTRL1_OSPM        ((uint32_t)0x04000000U) /* Oversampling mode */
#define UART_CTRL1_SWAP        ((uint32_t)0x08000000U) /* Swap TX/RX pins */

/** Bit definition for UART_CTRL2 register **/
#define UART_CTRL2_ADDR        ((uint32_t)0x0000000FU) /* Address of the UART node */
#define UART_CTRL2_STPB        ((uint32_t)0x00000060U) /* STOP[1:0] bits (STOP bits) */
#define UART_CTRL2_STPB_0      ((uint32_t)0x00000020U) /* Bit 0 */
#define UART_CTRL2_STPB_1      ((uint32_t)0x00000040U) /* Bit 1 */
#define UART_CTRL2_LINMEN      ((uint32_t)0x00001000U) /* LIN mode enable */
#define UART_CTRL2_LINBDIEN    ((uint32_t)0x00002000U) /* LIN Break Detection Interrupt Enable */
#define UART_CTRL2_LINBDL      ((uint32_t)0x00004000U) /* LIN Break Detection Length */
#define UART_CTRL2_RTOEN       ((uint32_t)0x00008000U) /* Receiver timeout enable */
#define UART_CTRL2_RTOCF       ((uint32_t)0x00010000U) /* Receiver timeout clear flag */
#define UART_CTRL2_RTOITE      ((uint32_t)0x00020000U) /* Receiver timeout interrupt enable */

/** Bit definition for UART_CTRL3 register **/
#define UART_CTRL3_HDMEN   ((uint32_t)0x00000008U) /* Half-Duplex Selection */
#define UART_CTRL3_DMATXEN ((uint32_t)0x00000010U) /* DMA Enable Transmitter */
#define UART_CTRL3_DMARXEN ((uint32_t)0x00000020U) /* DMA Enable Receiver */
#define UART_CTRL3_ERRIEN  ((uint32_t)0x00000040U) /* Error Interrupt Enable */
#define UART_CTRL3_IRDAMEN ((uint32_t)0x00000080U) /* IrDA mode Enable */
#define UART_CTRL3_IRDALP  ((uint32_t)0x00000100U) /* IrDA Low-Power */

/** Bit definition for UART_STS register **/
#define UART_STS_IDLEF     ((uint32_t)0x00000040U) /* IDLE line detected */
#define UART_STS_TXDE      ((uint32_t)0x00000080U) /* Transmit Data Register Empty */
#define UART_STS_TXC       ((uint32_t)0x00000100U) /* Transmission Complete */
#define UART_STS_RXDNE     ((uint32_t)0x00000200U) /* Read Data Register Not Empty */
#define UART_STS_LINBDF    ((uint32_t)0x00000800U) /* LIN Break Detection Flag */
#define UART_STS_PEF       ((uint32_t)0x00001000U) /* Parity Error */
#define UART_STS_OREF      ((uint32_t)0x00002000U) /* OverRun Error */
#define UART_STS_NEF       ((uint32_t)0x00004000U) /* Noise Error Flag */
#define UART_STS_FEF       ((uint32_t)0x00008000U) /* Framing Error */
#define UART_STS_RTOF      ((uint32_t)0x00010000U) /* recevier timeout */

/** Bit definition for UART_DAT register **/
#define UART_DAT_DATV      ((uint32_t)0x000001FFU) /* Data value */

/** Bit definition for UART_BRCF register **/
#define UART_BRCF_DIV_Decimal ((uint32_t)0x000FU) /* Fraction of UARTDIV */
#define UART_BRCF_DIV_Integer ((uint32_t)0xFFF0U) /* Mantissa of UARTDIV */

/** Bit definition for UART_GTP register **/
#define UART_GTP_PSCV   ((uint32_t)0x00FFU) /* PSC[7:0] bits (Prescaler value) */
#define UART_GTP_PSCV_0 ((uint32_t)0x0001U) /* Bit 0 */
#define UART_GTP_PSCV_1 ((uint32_t)0x0002U) /* Bit 1 */
#define UART_GTP_PSCV_2 ((uint32_t)0x0004U) /* Bit 2 */
#define UART_GTP_PSCV_3 ((uint32_t)0x0008U) /* Bit 3 */
#define UART_GTP_PSCV_4 ((uint32_t)0x0010U) /* Bit 4 */
#define UART_GTP_PSCV_5 ((uint32_t)0x0020U) /* Bit 5 */
#define UART_GTP_PSCV_6 ((uint32_t)0x0040U) /* Bit 6 */
#define UART_GTP_PSCV_7 ((uint32_t)0x0080U) /* Bit 7 */

/** Bit definition for UART_IFW register **/
#define UART_RTO_WIDTH_MASK        ((uint32_t)0x0FFFFFFFU) /* Receiver timeout value */

/** Bit definition for UART_WAKEUP register **/
#define UART_WAKEUP_EN_MASK            ((uint32_t)0x00000001U) /* Wakeup enable */
#define UART_WAKEUP_DATCLR_MASK        ((uint32_t)0x00000002U) /* Data clear when Wakeup */


/*** HDIV ***/

/** Bit definition for HDIV_CTRLSTS register **/
#define HDIV_CTRLSTS_HDIVEN            ((uint32_t)0x00000001U) /* HDIV enable */
#define HDIV_CTRLSTS_HDIVSTART         ((uint32_t)0x00000002U) /* HDIV start */
#define HDIV_CTRLSTS_HDIVDF            ((uint32_t)0x00000008U) /* HDIV done flag */
#define HDIV_CTRLSTS_HDIVBUSHOLD       ((uint32_t)0x00000040U) /* Indicate the bus when calculating. */   
#define HDIV_CTRLSTS_HDIVAUTOSTART     ((uint32_t)0x00000080U) /* auto start of calculating. */ 
#define HDIV_CTRLSTS_HDIVTYPESEL       ((uint32_t)0x00000100U) /* Indicate the type of the data. */

/** Bit definition for HDIV_DIVIDEND register***/
#define HDIV_DIVIDEND_DIVIDEND         ((uint32_t)0xFFFFFFFFU) /* 32bit unsigned interger dividend */

/** Bit definition for HDIV_DIVISOR register **/
#define HDIV_DIVISOR_DIVISOR           ((uint32_t)0xFFFFFFFFU) /* 32bit unsigned interger divisor */

