2zzyyyq/3C/CMSIS/device/n32g033.h
/** Bit definition for HDIV_QUOTIENT register***/
#define HDIV_QUOTIENT_QUOTIENT         ((uint32_t)0xFFFFFFFFU) /* Quotient calculated by the divider */

/** Bit definition for HDIV_REMAINDER registe****/
#define HDIV_REMAINDER_REMAINDER       ((uint32_t)0xFFFFFFFFU) /* Remainder calculated by the divider */

/** Bit definition for HDIV_DIVBY0 register  */
#define HDIV_DIVBY0_DIVBY0             ((uint32_t)0x00000001U) /* The divisor is 0 flag */


/*** Square Root Calculations(SQRT) ***/

/** Bit definition for SQRT_CTRLSTS register  **/
#define SQRT_CTRLSTS_SQRTEN            ((uint32_t)0x00000001U) /* SQRT enable */
#define SQRT_CTRLSTS_SQRTSTART         ((uint32_t)0x00000002U) /* SQRT start */
#define SQRT_CTRLSTS_SQRTDF            ((uint32_t)0x00000008U) /* SQRT done flag */
#define SQRT_CTRLSTS_BUSHOLD           ((uint32_t)0x00000040U) /* Indicate the bus when calculating. */  
#define SQRT_CTRLSTS_AUTOSTART         ((uint32_t)0x00000080U) /* auto start of calculating. */ 

/** Bit definition for SQRT_RADICANT register **/
#define SQRT_RADICANT_RADICANT         ((uint32_t)0xFFFFFFFFU) /* 32bit unsigned interger squared */

/** Bit definition for SQRT_ROOT register **/
#define SQRT_ROOT_ROOT                 ((uint32_t)0x0000FFFFU) /* 16bit Square root output */



/*** FLASH and Option Bytes Registers ***/

/** Bit definition for FLASH_AC register **/
#define FLASH_AC_LATENCY                                 ((uint32_t)0x00000007U)         /* Bit[2:0] */
#define FLASH_AC_LATENCY_0                               ((uint32_t)0x00000000U)         /* Bit 0 = 0 */
#define FLASH_AC_LATENCY_1                               ((uint32_t)0x00000001U)         /* Bit 0 = 1 */

/** Bit definition for FLASH_KEY register **/
#define FLASH_KEY_FKEY                                    ((uint32_t)0xFFFFFFFFU)        /* FLASH Key */

/** Bit definition for FLASH_OPTKEY register **/
#define FLASH_OPTKEY_OPTKEY                               ((uint32_t)0xFFFFFFFFU)         /* Option Byte Key */

/** Bit definition for FLASH_STS register **/
#define FLASH_STS_EOP                                     ((uint32_t)0x00000020U)         /* Bit[5] */
#define FLASH_STS_WRPERR                                  ((uint32_t)0x00000010U)         /* Bit[4] */
#define FLASH_STS_PGERR                                   ((uint32_t)0x00000004U)         /* Bit[2] */
#define FLASH_STS_BUSY                                    ((uint32_t)0x00000001U)         /* Bit[0] */

/** Bit definition for FLASH_CTRL register **/
#define FLASH_CTRL_EOPITE                                  ((uint32_t)0x00001000U)         /* Bit[12] */
#define FLASH_CTRL_ERRITE                                  ((uint32_t)0x00000400U)         /* Bit[10] */
#define FLASH_CTRL_OPTWE                                   ((uint32_t)0x00000200U)         /* Bit[9] */
#define FLASH_CTRL_LOCK                                    ((uint32_t)0x00000080U)         /* Bit[7] */
#define FLASH_CTRL_START                                   ((uint32_t)0x00000040U)         /* Bit[6] */
#define FLASH_CTRL_OPTER                                   ((uint32_t)0x00000020U)         /* Bit[5] */
#define FLASH_CTRL_OPTPG                                   ((uint32_t)0x00000010U)         /* Bit[4] */
#define FLASH_CTRL_MER                                     ((uint32_t)0x00000004U)         /* Bit[2] */
#define FLASH_CTRL_PER                                     ((uint32_t)0x00000002U)         /* Bit[1] */
#define FLASH_CTRL_PG                                      ((uint32_t)0x00000001U)         /* Bit[0] */

/** Bit definition for FLASH_ADD register **/
#define FLASH_ADD_FADD                                     ((uint32_t)0xFFFFFFFFU)        /* Flash Address */

/** Bit definition for FLASH_OB2 register **/
#define FLASH_OB2_Data1                                   ((uint32_t)0x0000FF00U)         /* Bit[15:8] */
#define FLASH_OB2_Data1_0                                 ((uint32_t)0x00000100U)         /* Bit8*/
#define FLASH_OB2_Data1_1                                 ((uint32_t)0x00000200U)         /* Bit9*/
#define FLASH_OB2_Data1_2                                 ((uint32_t)0x00000400U)         /* Bit10*/
#define FLASH_OB2_Data1_3                                 ((uint32_t)0x00000800U)         /* Bit11*/
#define FLASH_OB2_Data1_4                                 ((uint32_t)0x00001000U)         /* Bit12*/
#define FLASH_OB2_Data1_5                                 ((uint32_t)0x00002000U)         /* Bit13*/
#define FLASH_OB2_Data1_6                                 ((uint32_t)0x00004000U)         /* Bit14*/
#define FLASH_OB2_Data1_7                                 ((uint32_t)0x00008000U)         /* Bit15*/
#define FLASH_OB2_Data0                                   ((uint32_t)0x000000FFU)         /* Bit[7:0] */
#define FLASH_OB2_Data0_0                                 ((uint32_t)0x00000001U)         /* Bit0*/
#define FLASH_OB2_Data0_1                                 ((uint32_t)0x00000002U)         /* Bit1*/
#define FLASH_OB2_Data0_2                                 ((uint32_t)0x00000004U)         /* Bit2*/
#define FLASH_OB2_Data0_3                                 ((uint32_t)0x00000008U)         /* Bit3*/
#define FLASH_OB2_Data0_4                                 ((uint32_t)0x00000010U)         /* Bit4*/
#define FLASH_OB2_Data0_5                                 ((uint32_t)0x00000020U)         /* Bit5*/
#define FLASH_OB2_Data0_6                                 ((uint32_t)0x00000040U)         /* Bit6*/
#define FLASH_OB2_Data0_7                                 ((uint32_t)0x00000080U)         /* Bit7*/

/** Bit definition for FLASH_OB register **/
#define FLASH_OB_RDPRT2                                  ((uint32_t)0x80000000U)         /* Bit[31] */
#define FLASH_OB_BOOT_SEL                                ((uint32_t)0x00300000U)         /* Bit[21:20] */
#define FLASH_OB_BOOT_SEL_0                              ((uint32_t)0x00100000U)         /* Bit20*/
#define FLASH_OB_BOOT_SEL_1                              ((uint32_t)0x00200000U)         /* Bit21*/
#define FLASH_OB_BOOT0_CFG                               ((uint32_t)0x00008000U)         /* Bit[15] */
#define FLASH_OB_nSWBOOT0                                ((uint32_t)0x00004000U)         /* Bit[14] */
#define FLASH_OB_nBOOT1                                  ((uint32_t)0x00002000U)         /* Bit[13] */
#define FLASH_OB_nBOOT0                                  ((uint32_t)0x00001000U)         /* Bit[12] */
#define FLASH_OB_POR_DELAY                               ((uint32_t)0x00000FF0U)         /* Bit[11:4] */
#define FLASH_OB_POR_DELAY_0                             ((uint32_t)0x00000010U)         /* Bit4*/
#define FLASH_OB_POR_DELAY_1                             ((uint32_t)0x00000020U)         /* Bit5*/
#define FLASH_OB_POR_DELAY_2                             ((uint32_t)0x00000040U)         /* Bit6*/
#define FLASH_OB_POR_DELAY_3                             ((uint32_t)0x00000080U)         /* Bit7*/
#define FLASH_OB_POR_DELAY_4                             ((uint32_t)0x00000100U)         /* Bit8*/
#define FLASH_OB_POR_DELAY_5                             ((uint32_t)0x00000200U)         /* Bit9*/
#define FLASH_OB_POR_DELAY_6                             ((uint32_t)0x00000400U)         /* Bit10*/
#define FLASH_OB_POR_DELAY_7                             ((uint32_t)0x00000800U)         /* Bit11*/
#define FLASH_OB_NRST_PF3                                ((uint32_t)0x00000008U)         /* Bit[3] */
#define FLASH_OB_IWDG_SW                                 ((uint32_t)0x00000004U)         /* Bit[2] */
#define FLASH_OB_RDPRT1                                  ((uint32_t)0x00000002U)         /* Bit[1] */
#define FLASH_OB_OBERR                                   ((uint32_t)0x00000001U)         /* Bit[0] */

/** Bit definition for FLASH_WRP register **/
#define FLASH_WRP_WRPT                                     ((uint32_t)0x00FF00FFU)         /* Write Protect */
#define FLASH_WRP_WRPT_0                                   ((uint32_t)0x00000001U)         /* Bit0*/
#define FLASH_WRP_WRPT_1                                   ((uint32_t)0x00000002U)         /* Bit1*/
#define FLASH_WRP_WRPT_2                                   ((uint32_t)0x00000004U)         /* Bit2*/
#define FLASH_WRP_WRPT_3                                   ((uint32_t)0x00000008U)         /* Bit3*/
#define FLASH_WRP_WRPT_4                                   ((uint32_t)0x00000010U)         /* Bit4*/
#define FLASH_WRP_WRPT_5                                   ((uint32_t)0x00000020U)         /* Bit5*/
#define FLASH_WRP_WRPT_6                                   ((uint32_t)0x00000040U)         /* Bit6*/
#define FLASH_WRP_WRPT_7                                   ((uint32_t)0x00000080U)         /* Bit7*/
#define FLASH_WRP_WRPT_8                                   ((uint32_t)0x00010000U)         /* Bit8*/
#define FLASH_WRP_WRPT_9                                   ((uint32_t)0x00020000U)         /* Bit9*/
#define FLASH_WRP_WRPT_10                                  ((uint32_t)0x00040000U)         /* Bit10*/
#define FLASH_WRP_WRPT_11                                  ((uint32_t)0x00080000U)         /* Bit11*/
#define FLASH_WRP_WRPT_12                                  ((uint32_t)0x00100000U)         /* Bit12*/
#define FLASH_WRP_WRPT_13                                  ((uint32_t)0x00200000U)         /* Bit13*/
#define FLASH_WRP_WRPT_14                                  ((uint32_t)0x00400000U)         /* Bit14*/
#define FLASH_WRP_WRPT_15                                  ((uint32_t)0x00800000U)         /* Bit15*/

/** Bit definition for FLASH_VTOR register **/
#define FLASH_VTOR_EN                                     ((uint32_t)0x80000000U)         /* Bit[31] */
#define FLASH_VTOR_VALUE                                  ((uint32_t)0x7FFFFFFFU)         /* Bit[30:0] */

