2zzyyyq/3C/CMSIS/device/n32g033.h
/*** Option Bytes register ***/

/**  Bit definition for FLASH_RDP register  **/
#define  FLASH_RDP_RDP1                      ((uint32_t)0x000000FFU)        /* Read protection option byte */
#define  FLASH_RDP_nRDP1                     ((uint32_t)0x0000FF00U)        /* Read protection complemented option byte */

/**  Bit definition for FLASH_USER0 register  **/
#define  FLASH_USER_USER0                    ((uint32_t)0x00FF00FFU)        /* User option byte */
#define  FLASH_USER_nUSER0                   ((uint32_t)0xFF00FF00U)        /* User complemented option byte */

/**  Bit definition for FLASH_USER1 register  **/
#define  FLASH_USER_USER1                    ((uint32_t)0x00FF00FFU)        /* User option byte */
#define  FLASH_USER_nUSER1                   ((uint32_t)0xFF00FF00U)        /* User complemented option byte */

/**  Bit definition for FLASH_USER2 register  **/
#define  FLASH_USER_USER2                    ((uint32_t)0x000000FFU)        /* User option byte */
#define  FLASH_USER_nUSER2                   ((uint32_t)0x0000FF00U)        /* User complemented option byte */

/**  Bit definition for FLASH_USER3 register  **/
#define  FLASH_USER_USER3                    ((uint32_t)0x00FF0000U)        /* User option byte */
#define  FLASH_USER_nUSER3                   ((uint32_t)0xFF000000U)        /* User complemented option byte */

/**  Bit definition for FLASH_USER4 register  **/
#define  FLASH_USER_USER4                    ((uint32_t)0x00FF0000U)        /* User option byte */
#define  FLASH_USER_nUSER4                   ((uint32_t)0xFF000000U)        /* User complemented option byte */

/**  Bit definition for FLASH_Data0 register  **/
#define  FLASH_Data0_Data0                   ((uint32_t)0x000000FFU)        /* User data storage option byte */
#define  FLASH_Data0_nData0                  ((uint32_t)0x0000FF00U)        /* User data storage complemented option byte */

/**  Bit definition for FLASH_Data1 register  **/
#define  FLASH_Data1_Data1                   ((uint32_t)0x00FF0000U)        /* User data storage option byte */
#define  FLASH_Data1_nData1                  ((uint32_t)0xFF000000U)        /* User data storage complemented option byte */

/**  Bit definition for OptionByte WRP0  **/
#define FLASH_WRP0_WRP0                      ((uint32_t)0x000000FFU)        /* Flash memory write protection option bytes */
#define FLASH_WRP0_NWRP0                     ((uint32_t)0x0000FF00U)        /* Flash memory write protection complemented option bytes */

/**  Bit definition for OptionByte WRP1  **/
#define FLASH_WRP1_WRP1                      ((uint32_t)0x00FF0000U)        /* Flash memory write protection option bytes */
#define FLASH_WRP1_NWRP1                     ((uint32_t)0xFF000000U)        /* Flash memory write protection complemented option bytes */

/**  Bit definition for FLASH_RDP2 register  **/
#define  FLASH_RDP_RDP2                      ((uint32_t)0x000000FFU)        /* Read protection level 2 option byte */
#define  FLASH_RDP_nRDP2                     ((uint32_t)0x0000FF00U)        /* Read protection level 2 complemented option byte */

/*** General Purpose and Alternate Function I/O ***/

/** Bit definition for GPIO_PMODE register **/
#define GPIO_PMODE0_Pos            (uint32_t)(0U)                                   
#define GPIO_PMODE0_Msk            (uint32_t)(0x3U << GPIO_PMODE0_Pos)         /* 0x00000003 */ 
#define GPIO_PMODE0                (uint32_t)         GPIO_PMODE0_Msk          /* 0x00000003 */
#define GPIO_PMODE0_0              (uint32_t)(0x0U << GPIO_PMODE0_Pos)         /* 0x00000000 */
#define GPIO_PMODE0_1              (uint32_t)(0x1U << GPIO_PMODE0_Pos)         /* 0x00000001 */
#define GPIO_PMODE0_2              (uint32_t)(0x2U << GPIO_PMODE0_Pos)         /* 0x00000002 */
#define GPIO_PMODE0_3              (uint32_t)(0x3U << GPIO_PMODE0_Pos)         /* 0x00000003 */

#define GPIO_PMODE1_Pos            (uint32_t)(2U)                                   
#define GPIO_PMODE1_Msk            (uint32_t)(0x3U << GPIO_PMODE1_Pos)         /* 0x0000000C */
#define GPIO_PMODE1                (uint32_t)         GPIO_PMODE1_Msk          /* 0x0000000C */
#define GPIO_PMODE1_0              (uint32_t)(0x0U << GPIO_PMODE1_Pos)         /* 0x00000000 */
#define GPIO_PMODE1_1              (uint32_t)(0x1U << GPIO_PMODE1_Pos)         /* 0x00000004 */
#define GPIO_PMODE1_2              (uint32_t)(0x2U << GPIO_PMODE1_Pos)         /* 0x00000008 */
#define GPIO_PMODE1_3              (uint32_t)(0x3U << GPIO_PMODE1_Pos)         /* 0x0000000C */

#define GPIO_PMODE2_Pos            (uint32_t)(4U)                                   
#define GPIO_PMODE2_Msk            (uint32_t)(0x3U << GPIO_PMODE2_Pos)         /* 0x00000030 */               
#define GPIO_PMODE2                (uint32_t)         GPIO_PMODE2_Msk          /* 0x00000030 */
#define GPIO_PMODE2_0              (uint32_t)(0x0U << GPIO_PMODE2_Pos)         /* 0x00000000 */
#define GPIO_PMODE2_1              (uint32_t)(0x1U << GPIO_PMODE2_Pos)         /* 0x00000010 */
#define GPIO_PMODE2_2              (uint32_t)(0x2U << GPIO_PMODE2_Pos)         /* 0x00000020 */
#define GPIO_PMODE2_3              (uint32_t)(0x3U << GPIO_PMODE2_Pos)         /* 0x00000030 */

#define GPIO_PMODE3_Pos            (uint32_t)(6U)                                   
#define GPIO_PMODE3_Msk            (uint32_t)(0x3U << GPIO_PMODE3_Pos)         /* 0x000000C0 */
#define GPIO_PMODE3                (uint32_t)         GPIO_PMODE3_Msk          /* 0x000000C0 */
#define GPIO_PMODE3_0              (uint32_t)(0x0U << GPIO_PMODE3_Pos)         /* 0x00000000 */
#define GPIO_PMODE3_1              (uint32_t)(0x1U << GPIO_PMODE3_Pos)         /* 0x00000040 */
#define GPIO_PMODE3_2              (uint32_t)(0x2U << GPIO_PMODE3_Pos)         /* 0x00000080 */
#define GPIO_PMODE3_3              (uint32_t)(0x3U << GPIO_PMODE3_Pos)         /* 0x000000C0 */

#define GPIO_PMODE4_Pos            (uint32_t)(8U)                                   
#define GPIO_PMODE4_Msk            (uint32_t)(0x3U << GPIO_PMODE4_Pos)         /* 0x00000300 */ 
#define GPIO_PMODE4                (uint32_t)         GPIO_PMODE4_Msk          /* 0x00000300 */
#define GPIO_PMODE4_0              (uint32_t)(0x0U << GPIO_PMODE4_Pos)         /* 0x00000000 */
#define GPIO_PMODE4_1              (uint32_t)(0x1U << GPIO_PMODE4_Pos)         /* 0x00000100 */
#define GPIO_PMODE4_2              (uint32_t)(0x2U << GPIO_PMODE4_Pos)         /* 0x00000100 */
#define GPIO_PMODE4_3              (uint32_t)(0x3U << GPIO_PMODE4_Pos)         /* 0x00000300 */

#define GPIO_PMODE5_Pos            (uint32_t)(10U)                                   
#define GPIO_PMODE5_Msk            (uint32_t)(0x3U << GPIO_PMODE5_Pos)         /* 0x00000C00 */
#define GPIO_PMODE5                (uint32_t)         GPIO_PMODE5_Msk          /* 0x00000C00 */
#define GPIO_PMODE5_0              (uint32_t)(0x0U << GPIO_PMODE5_Pos)         /* 0x00000000 */
#define GPIO_PMODE5_1              (uint32_t)(0x1U << GPIO_PMODE5_Pos)         /* 0x00000400 */
#define GPIO_PMODE5_2              (uint32_t)(0x2U << GPIO_PMODE5_Pos)         /* 0x00000800 */
#define GPIO_PMODE5_3              (uint32_t)(0x3U << GPIO_PMODE5_Pos)         /* 0x00000C00 */

#define GPIO_PMODE6_Pos            (uint32_t)(12U)                                   
#define GPIO_PMODE6_Msk            (uint32_t)(0x3U << GPIO_PMODE6_Pos)         /* 0x00003000 */      
#define GPIO_PMODE6                (uint32_t)         GPIO_PMODE6_Msk          /* 0x00003000 */
#define GPIO_PMODE6_0              (uint32_t)(0x0U << GPIO_PMODE6_Pos)         /* 0x00000000 */
#define GPIO_PMODE6_1              (uint32_t)(0x1U << GPIO_PMODE6_Pos)         /* 0x00001000 */
#define GPIO_PMODE6_2              (uint32_t)(0x2U << GPIO_PMODE6_Pos)         /* 0x00002000 */
#define GPIO_PMODE6_3              (uint32_t)(0x3U << GPIO_PMODE6_Pos)         /* 0x00003000 */

#define GPIO_PMODE7_Pos            (uint32_t)(14U)                                   
#define GPIO_PMODE7_Msk            (uint32_t)(0x3U << GPIO_PMODE7_Pos)         /* 0x0000C000 */
#define GPIO_PMODE7                (uint32_t)         GPIO_PMODE7_Msk          /* 0x0000C000 */
#define GPIO_PMODE7_0              (uint32_t)(0x0U << GPIO_PMODE7_Pos)         /* 0x00000000 */
#define GPIO_PMODE7_1              (uint32_t)(0x1U << GPIO_PMODE7_Pos)         /* 0x00004000 */
#define GPIO_PMODE7_2              (uint32_t)(0x2U << GPIO_PMODE7_Pos)         /* 0x00008000 */
#define GPIO_PMODE7_3              (uint32_t)(0x3U << GPIO_PMODE7_Pos)         /* 0x0000C000 */

#define GPIO_PMODE8_Pos            (uint32_t)(16U)                                   
#define GPIO_PMODE8_Msk            (uint32_t)(0x3U << GPIO_PMODE8_Pos)         /* 0x00030000 */
#define GPIO_PMODE8                (uint32_t)         GPIO_PMODE8_Msk          /* 0x00030000 */
#define GPIO_PMODE8_0              (uint32_t)(0x0U << GPIO_PMODE8_Pos)         /* 0x00000000 */
#define GPIO_PMODE8_1              (uint32_t)(0x1U << GPIO_PMODE8_Pos)         /* 0x00010000 */
#define GPIO_PMODE8_2              (uint32_t)(0x2U << GPIO_PMODE8_Pos)         /* 0x00020000 */
#define GPIO_PMODE8_3              (uint32_t)(0x3U << GPIO_PMODE8_Pos)         /* 0x00030000 */

#define GPIO_PMODE9_Pos            (uint32_t)(18U)                                   
#define GPIO_PMODE9_Msk            (uint32_t)(0x3U << GPIO_PMODE9_Pos)         /* 0x000C0000 */
#define GPIO_PMODE9                (uint32_t)         GPIO_PMODE9_Msk          /* 0x000C0000 */
#define GPIO_PMODE9_0              (uint32_t)(0x0U << GPIO_PMODE9_Pos)         /* 0x00000000 */
#define GPIO_PMODE9_1              (uint32_t)(0x1U << GPIO_PMODE9_Pos)         /* 0x00040000 */
#define GPIO_PMODE9_2              (uint32_t)(0x2U << GPIO_PMODE9_Pos)         /* 0x00080000 */
#define GPIO_PMODE9_3              (uint32_t)(0x3U << GPIO_PMODE9_Pos)         /* 0x000C0000 */

