2zzyyyq/3C/CMSIS/device/n32g033.h
#define GPIO_PMODE10_Pos           (uint32_t)(20U)                                   
#define GPIO_PMODE10_Msk           (uint32_t)(0x3U << GPIO_PMODE10_Pos)         /* 0x00300000 */ 
#define GPIO_PMODE10               (uint32_t)         GPIO_PMODE10_Msk          /* 0x00300000 */
#define GPIO_PMODE10_0             (uint32_t)(0x0U << GPIO_PMODE10_Pos)         /* 0x00000000 */
#define GPIO_PMODE10_1             (uint32_t)(0x1U << GPIO_PMODE10_Pos)         /* 0x00100000 */
#define GPIO_PMODE10_2             (uint32_t)(0x2U << GPIO_PMODE10_Pos)         /* 0x00200000 */
#define GPIO_PMODE10_3             (uint32_t)(0x3U << GPIO_PMODE10_Pos)         /* 0x00300000 */

#define GPIO_PMODE11_Pos           (uint32_t)(22U)                                   
#define GPIO_PMODE11_Msk           (uint32_t)(0x3U << GPIO_PMODE11_Pos)         /* 0x00C00000 */ 
#define GPIO_PMODE11               (uint32_t)         GPIO_PMODE11_Msk          /* 0x00C00000 */
#define GPIO_PMODE11_0             (uint32_t)(0x0U << GPIO_PMODE11_Pos)         /* 0x00000000 */
#define GPIO_PMODE11_1             (uint32_t)(0x1U << GPIO_PMODE11_Pos)         /* 0x00400000 */
#define GPIO_PMODE11_2             (uint32_t)(0x2U << GPIO_PMODE11_Pos)         /* 0x00800000 */
#define GPIO_PMODE11_3             (uint32_t)(0x3U << GPIO_PMODE11_Pos)         /* 0x00C00000 */

#define GPIO_PMODE12_Pos           (uint32_t)(24U)                                   
#define GPIO_PMODE12_Msk           (uint32_t)(0x3U << GPIO_PMODE12_Pos)         /* 0x03000000 */
#define GPIO_PMODE12               (uint32_t)         GPIO_PMODE12_Msk          /* 0x03000000 */
#define GPIO_PMODE12_0             (uint32_t)(0x0U << GPIO_PMODE12_Pos)         /* 0x00000000 */
#define GPIO_PMODE12_1             (uint32_t)(0x1U << GPIO_PMODE12_Pos)         /* 0x01000000 */
#define GPIO_PMODE12_2             (uint32_t)(0x2U << GPIO_PMODE12_Pos)         /* 0x02000000 */
#define GPIO_PMODE12_3             (uint32_t)(0x3U << GPIO_PMODE12_Pos)         /* 0x03000000 */

#define GPIO_PMODE13_Pos           (uint32_t)(26U)                                   
#define GPIO_PMODE13_Msk           (uint32_t)(0x3U << GPIO_PMODE13_Pos)         /* 0x0C000000 */
#define GPIO_PMODE13               (uint32_t)         GPIO_PMODE13_Msk          /* 0x0C000000 */
#define GPIO_PMODE13_0             (uint32_t)(0x0U << GPIO_PMODE13_Pos)         /* 0x00000000 */
#define GPIO_PMODE13_1             (uint32_t)(0x1U << GPIO_PMODE13_Pos)         /* 0x04000000 */
#define GPIO_PMODE13_2             (uint32_t)(0x2U << GPIO_PMODE13_Pos)         /* 0x08000000 */
#define GPIO_PMODE13_3             (uint32_t)(0x3U << GPIO_PMODE13_Pos)         /* 0x0C000000 */

#define GPIO_PMODE14_Pos           (uint32_t)(28U)                                   
#define GPIO_PMODE14_Msk           (uint32_t)(0x3U << GPIO_PMODE14_Pos)         /* 0x30000000 */
#define GPIO_PMODE14               (uint32_t)         GPIO_PMODE14_Msk          /* 0x30000000 */
#define GPIO_PMODE14_0             (uint32_t)(0x0U << GPIO_PMODE14_Pos)         /* 0x00000000 */
#define GPIO_PMODE14_1             (uint32_t)(0x1U << GPIO_PMODE14_Pos)         /* 0x10000000 */
#define GPIO_PMODE14_2             (uint32_t)(0x2U << GPIO_PMODE14_Pos)         /* 0x20000000 */
#define GPIO_PMODE14_3             (uint32_t)(0x3U << GPIO_PMODE14_Pos)         /* 0x30000000 */

#define GPIO_PMODE15_Pos           (uint32_t)(30U)                                   
#define GPIO_PMODE15_Msk           (uint32_t)(0x3U << GPIO_PMODE15_Pos)         /* 0xC0000000 */
#define GPIO_PMODE15               (uint32_t)         GPIO_PMODE15_Msk          /* 0xC0000000 */
#define GPIO_PMODE15_0             (uint32_t)(0x0U << GPIO_PMODE15_Pos)         /* 0x00000000 */
#define GPIO_PMODE15_1             (uint32_t)(0x1U << GPIO_PMODE15_Pos)         /* 0x40000000 */
#define GPIO_PMODE15_2             (uint32_t)(0x2U << GPIO_PMODE15_Pos)         /* 0x80000000 */
#define GPIO_PMODE15_3             (uint32_t)(0x3U << GPIO_PMODE15_Pos)         /* 0xC0000000 */

/** Bit definition for GPIO_POTYPE register **/
#define GPIO_POTYPE_POT0           ((uint16_t)0x0001U) 
#define GPIO_POTYPE_POT1           ((uint16_t)0x0002U) 
#define GPIO_POTYPE_POT2           ((uint16_t)0x0004U) 
#define GPIO_POTYPE_POT3           ((uint16_t)0x0008U) 
#define GPIO_POTYPE_POT4           ((uint16_t)0x0010U) 
#define GPIO_POTYPE_POT5           ((uint16_t)0x0020U) 
#define GPIO_POTYPE_POT6           ((uint16_t)0x0040U) 
#define GPIO_POTYPE_POT7           ((uint16_t)0x0080U) 
#define GPIO_POTYPE_POT8           ((uint16_t)0x0100U) 
#define GPIO_POTYPE_POT9           ((uint16_t)0x0200U) 
#define GPIO_POTYPE_POT10          ((uint16_t)0x0400U) 
#define GPIO_POTYPE_POT11          ((uint16_t)0x0800U) 
#define GPIO_POTYPE_POT12          ((uint16_t)0x1000U) 
#define GPIO_POTYPE_POT13          ((uint16_t)0x2000U) 
#define GPIO_POTYPE_POT14          ((uint16_t)0x4000U) 
#define GPIO_POTYPE_POT15          ((uint16_t)0x8000U)                          

/** Bit definition for GPIO_PUPD register **/
#define GPIO_PUPD0_Pos             (uint32_t)(0U)                                   
#define GPIO_PUPD0_Msk             (uint32_t)(0x3U << GPIO_PUPD0_Pos)         /* 0x00000003 */
#define GPIO_PUPD0                 (uint32_t)         GPIO_PUPD0_Msk          /* 0x00000003 */     
#define GPIO_PUPD0_0               (uint32_t)(0x0U << GPIO_PUPD0_Pos)         /* 0x00000000 */
#define GPIO_PUPD0_1               (uint32_t)(0x1U << GPIO_PUPD0_Pos)         /* 0x00000001 */
#define GPIO_PUPD0_2               (uint32_t)(0x2U << GPIO_PUPD0_Pos)         /* 0x00000002 */

#define GPIO_PUPD1_Pos             (uint32_t)(2U)                                   
#define GPIO_PUPD1_Msk             (uint32_t)(0x3U << GPIO_PUPD1_Pos)         /* 0x0000000C */
#define GPIO_PUPD1                 (uint32_t)         GPIO_PUPD1_Msk          /* 0x0000000C */     
#define GPIO_PUPD1_0               (uint32_t)(0x0U << GPIO_PUPD1_Pos)         /* 0x00000000 */
#define GPIO_PUPD1_1               (uint32_t)(0x1U << GPIO_PUPD1_Pos)         /* 0x00000004 */
#define GPIO_PUPD1_2               (uint32_t)(0x2U << GPIO_PUPD1_Pos)         /* 0x00000008 */

