2zzyyyq/3C/CMSIS/device/n32g033.h
#define GPIO_PUPD2_Pos             (uint32_t)(4U)                                   
#define GPIO_PUPD2_Msk             (uint32_t)(0x3U << GPIO_PUPD2_Pos)         /* 0x00000030 */
#define GPIO_PUPD2                 (uint32_t)         GPIO_PUPD2_Msk          /* 0x00000030 */       
#define GPIO_PUPD2_0               (uint32_t)(0x0U << GPIO_PUPD2_Pos)         /* 0x00000000 */
#define GPIO_PUPD2_1               (uint32_t)(0x1U << GPIO_PUPD2_Pos)         /* 0x00000010 */
#define GPIO_PUPD2_2               (uint32_t)(0x2U << GPIO_PUPD2_Pos)         /* 0x00000020 */

#define GPIO_PUPD3_Pos             (uint32_t)(6U)                                   
#define GPIO_PUPD3_Msk             (uint32_t)(0x3U << GPIO_PUPD3_Pos)         /* 0x000000C0 */
#define GPIO_PUPD3                 (uint32_t)         GPIO_PUPD3_Msk          /* 0x000000C0 */        
#define GPIO_PUPD3_0               (uint32_t)(0x0U << GPIO_PUPD3_Pos)         /* 0x00000000 */
#define GPIO_PUPD3_1               (uint32_t)(0x1U << GPIO_PUPD3_Pos)         /* 0x00000040 */
#define GPIO_PUPD3_2               (uint32_t)(0x2U << GPIO_PUPD3_Pos)         /* 0x00000080 */

#define GPIO_PUPD4_Pos             (uint32_t)(8U)                                   
#define GPIO_PUPD4_Msk             (uint32_t)(0x3U << GPIO_PUPD4_Pos)         /* 0x00000300 */
#define GPIO_PUPD4                 (uint32_t)         GPIO_PUPD4_Msk          /* 0x00000300 */         
#define GPIO_PUPD4_0               (uint32_t)(0x0U << GPIO_PUPD4_Pos)         /* 0x00000000 */
#define GPIO_PUPD4_1               (uint32_t)(0x1U << GPIO_PUPD4_Pos)         /* 0x00000100 */
#define GPIO_PUPD4_2               (uint32_t)(0x2U << GPIO_PUPD4_Pos)         /* 0x00000200 */

#define GPIO_PUPD5_Pos             (uint32_t)(10U)                                   
#define GPIO_PUPD5_Msk             (uint32_t)(0x3U << GPIO_PUPD5_Pos)         /* 0x00000C00 */
#define GPIO_PUPD5                 (uint32_t)         GPIO_PUPD5_Msk          /* 0x00000C00 */         
#define GPIO_PUPD5_0               (uint32_t)(0x0U << GPIO_PUPD5_Pos)         /* 0x00000000 */
#define GPIO_PUPD5_1               (uint32_t)(0x1U << GPIO_PUPD5_Pos)         /* 0x00000400 */
#define GPIO_PUPD5_2               (uint32_t)(0x2U << GPIO_PUPD5_Pos)         /* 0x00000800 */

#define GPIO_PUPD6_Pos             (uint32_t)(12U)                                   
#define GPIO_PUPD6_Msk             (uint32_t)(0x3U << GPIO_PUPD6_Pos)         /* 0x00003000 */
#define GPIO_PUPD6                 (uint32_t)         GPIO_PUPD6_Msk          /* 0x00003000 */         
#define GPIO_PUPD6_0               (uint32_t)(0x0U << GPIO_PUPD6_Pos)         /* 0x00000000 */
#define GPIO_PUPD6_1               (uint32_t)(0x1U << GPIO_PUPD6_Pos)         /* 0x00001000 */
#define GPIO_PUPD6_2               (uint32_t)(0x2U << GPIO_PUPD6_Pos)         /* 0x00002000 */

#define GPIO_PUPD7_Pos             (uint32_t)(14U)                                   
#define GPIO_PUPD7_Msk             (uint32_t)(0x3U << GPIO_PUPD7_Pos)         /* 0x0000C000 */
#define GPIO_PUPD7                 (uint32_t)         GPIO_PUPD7_Msk          /* 0x0000C000 */         
#define GPIO_PUPD7_0               (uint32_t)(0x0U << GPIO_PUPD7_Pos)         /* 0x00000000 */
#define GPIO_PUPD7_1               (uint32_t)(0x1U << GPIO_PUPD7_Pos)         /* 0x00004000 */
#define GPIO_PUPD7_2               (uint32_t)(0x2U << GPIO_PUPD7_Pos)         /* 0x00008000 */

#define GPIO_PUPD8_Pos             (uint32_t)(16U)                                   
#define GPIO_PUPD8_Msk             (uint32_t)(0x3U << GPIO_PUPD8_Pos)         /* 0x00030000 */
#define GPIO_PUPD8                 (uint32_t)         GPIO_PUPD8_Msk          /* 0x00030000 */         
#define GPIO_PUPD8_0               (uint32_t)(0x0U << GPIO_PUPD8_Pos)         /* 0x00000000 */
#define GPIO_PUPD8_1               (uint32_t)(0x1U << GPIO_PUPD8_Pos)         /* 0x00010000 */
#define GPIO_PUPD8_2               (uint32_t)(0x2U << GPIO_PUPD8_Pos)         /* 0x00020000 */

#define GPIO_PUPD9_Pos             (uint32_t)(18U)                                   
#define GPIO_PUPD9_Msk             (uint32_t)(0x3U << GPIO_PUPD9_Pos)         /* 0x000C0000 */
#define GPIO_PUPD9                 (uint32_t)         GPIO_PUPD9_Msk          /* 0x000C0000 */         
#define GPIO_PUPD9_0               (uint32_t)(0x0U << GPIO_PUPD9_Pos)         /* 0x00000000 */
#define GPIO_PUPD9_1               (uint32_t)(0x1U << GPIO_PUPD9_Pos)         /* 0x00040000 */
#define GPIO_PUPD9_2               (uint32_t)(0x2U << GPIO_PUPD9_Pos)         /* 0x00080000 */

#define GPIO_PUPD10_Pos            (uint32_t)(20U)                                   
#define GPIO_PUPD10_Msk            (uint32_t)(0x3U << GPIO_PUPD10_Pos)        /* 0x00300000 */
#define GPIO_PUPD10                (uint32_t)         GPIO_PUPD10_Msk         /* 0x00300000 */         
#define GPIO_PUPD10_0              (uint32_t)(0x0U << GPIO_PUPD10_Pos)        /* 0x00000000 */
#define GPIO_PUPD10_1              (uint32_t)(0x1U << GPIO_PUPD10_Pos)        /* 0x00100000 */
#define GPIO_PUPD10_2              (uint32_t)(0x2U << GPIO_PUPD10_Pos)        /* 0x00200000 */

#define GPIO_PUPD11_Pos            (uint32_t)(22U)                                   
#define GPIO_PUPD11_Msk            (uint32_t)(0x3U << GPIO_PUPD11_Pos)        /* 0x00C00000 */
#define GPIO_PUPD11                (uint32_t)         GPIO_PUPD11_Msk         /* 0x00C00000 */         
#define GPIO_PUPD11_0              (uint32_t)(0x0U << GPIO_PUPD11_Pos)        /* 0x00000000 */
#define GPIO_PUPD11_1              (uint32_t)(0x1U << GPIO_PUPD11_Pos)        /* 0x00400000 */
#define GPIO_PUPD11_2              (uint32_t)(0x2U << GPIO_PUPD11_Pos)        /* 0x00800000 */

#define GPIO_PUPD12_Pos            (uint32_t)(24U)                                   
#define GPIO_PUPD12_Msk            (uint32_t)(0x3U << GPIO_PUPD12_Pos)        /* 0x03000000 */
#define GPIO_PUPD12                (uint32_t)         GPIO_PUPD12_Msk         /* 0x03000000 */         
#define GPIO_PUPD12_0              (uint32_t)(0x0U << GPIO_PUPD12_Pos)        /* 0x00000000 */
#define GPIO_PUPD12_1              (uint32_t)(0x1U << GPIO_PUPD12_Pos)        /* 0x01000000 */
#define GPIO_PUPD12_2              (uint32_t)(0x2U << GPIO_PUPD12_Pos)        /* 0x02000000 */

#define GPIO_PUPD13_Pos            (uint32_t)(26U)                                   
#define GPIO_PUPD13_Msk            (uint32_t)(0x3U << GPIO_PUPD13_Pos)         /* 0x0C000000 */
#define GPIO_PUPD13                (uint32_t)         GPIO_PUPD13_Msk          /* 0x0C000000 */         
#define GPIO_PUPD13_0              (uint32_t)(0x0U << GPIO_PUPD13_Pos)         /* 0x00000000 */
#define GPIO_PUPD13_1              (uint32_t)(0x1U << GPIO_PUPD13_Pos)         /* 0x04000000 */
#define GPIO_PUPD13_2              (uint32_t)(0x2U << GPIO_PUPD13_Pos)         /* 0x08000000 */

#define GPIO_PUPD14_Pos            (uint32_t)(28U)                                   
#define GPIO_PUPD14_Msk            (uint32_t)(0x3U << GPIO_PUPD14_Pos)         /* 0x30000000 */
#define GPIO_PUPD14                (uint32_t)         GPIO_PUPD14_Msk          /* 0x30000000 */ 
#define GPIO_PUPD14_0              (uint32_t)(0x0U << GPIO_PUPD14_Pos)         /* 0x00000000 */
#define GPIO_PUPD14_1              (uint32_t)(0x1U << GPIO_PUPD14_Pos)         /* 0x10000000 */
#define GPIO_PUPD14_2              (uint32_t)(0x2U << GPIO_PUPD14_Pos)         /* 0x30000000 */

#define GPIO_PUPD15_Pos            (uint32_t)(30U)                                   
#define GPIO_PUPD15_Msk            (uint32_t)(0x3U << GPIO_PUPD15_Pos)         /* 0xC0000000 */
#define GPIO_PUPD15                (uint32_t)         GPIO_PUPD15_Msk          /* 0xC0000000 */         
#define GPIO_PUPD15_0              (uint32_t)(0x0U << GPIO_PUPD15_Pos)         /* 0x00000000 */
#define GPIO_PUPD15_1              (uint32_t)(0x1U << GPIO_PUPD15_Pos)         /* 0x40000000 */
#define GPIO_PUPD15_2              (uint32_t)(0x2U << GPIO_PUPD15_Pos)         /* 0x80000000 */

/** Bit definition for GPIO_PID register **/
#define GPIO_PID_PID0              ((uint16_t)0x0001U) /* Port input data, bit 0  */
#define GPIO_PID_PID1              ((uint16_t)0x0002U) /* Port input data, bit 1  */
#define GPIO_PID_PID2              ((uint16_t)0x0004U) /* Port input data, bit 2  */
#define GPIO_PID_PID3              ((uint16_t)0x0008U) /* Port input data, bit 3  */
#define GPIO_PID_PID4              ((uint16_t)0x0010U) /* Port input data, bit 4  */
#define GPIO_PID_PID5              ((uint16_t)0x0020U) /* Port input data, bit 5  */
#define GPIO_PID_PID6              ((uint16_t)0x0040U) /* Port input data, bit 6  */
#define GPIO_PID_PID7              ((uint16_t)0x0080U) /* Port input data, bit 7  */
#define GPIO_PID_PID8              ((uint16_t)0x0100U) /* Port input data, bit 8  */
#define GPIO_PID_PID9              ((uint16_t)0x0200U) /* Port input data, bit 9  */
#define GPIO_PID_PID10             ((uint16_t)0x0400U) /* Port input data, bit 10 */
#define GPIO_PID_PID11             ((uint16_t)0x0800U) /* Port input data, bit 11 */
#define GPIO_PID_PID12             ((uint16_t)0x1000U) /* Port input data, bit 12 */
#define GPIO_PID_PID13             ((uint16_t)0x2000U) /* Port input data, bit 13 */
#define GPIO_PID_PID14             ((uint16_t)0x4000U) /* Port input data, bit 14 */
#define GPIO_PID_PID15             ((uint16_t)0x8000U) /* Port input data, bit 15 */

/** Bit definition for GPIO_POD register **/
#define GPIO_POD_POD0              ((uint16_t)0x0001U) /* Port output data, bit 0  */
#define GPIO_POD_POD1              ((uint16_t)0x0002U) /* Port output data, bit 1  */
#define GPIO_POD_POD2              ((uint16_t)0x0004U) /* Port output data, bit 2  */
#define GPIO_POD_POD3              ((uint16_t)0x0008U) /* Port output data, bit 3  */
#define GPIO_POD_POD4              ((uint16_t)0x0010U) /* Port output data, bit 4  */
#define GPIO_POD_POD5              ((uint16_t)0x0020U) /* Port output data, bit 5  */
#define GPIO_POD_POD6              ((uint16_t)0x0040U) /* Port output data, bit 6  */
#define GPIO_POD_POD7              ((uint16_t)0x0080U) /* Port output data, bit 7  */
#define GPIO_POD_POD8              ((uint16_t)0x0100U) /* Port output data, bit 8  */
#define GPIO_POD_POD9              ((uint16_t)0x0200U) /* Port output data, bit 9  */
#define GPIO_POD_POD10             ((uint16_t)0x0400U) /* Port output data, bit 10 */
#define GPIO_POD_POD11             ((uint16_t)0x0800U) /* Port output data, bit 11 */
#define GPIO_POD_POD12             ((uint16_t)0x1000U) /* Port output data, bit 12 */
#define GPIO_POD_POD13             ((uint16_t)0x2000U) /* Port output data, bit 13 */
#define GPIO_POD_POD14             ((uint16_t)0x4000U) /* Port output data, bit 14 */
#define GPIO_POD_POD15             ((uint16_t)0x8000U) /* Port output data, bit 15 */

/** Bit definition for GPIO_PBSC register **/
#define GPIO_PBSC_PBS0             ((uint32_t)0x00000001U) /* Port x Set bit 0  */
#define GPIO_PBSC_PBS1             ((uint32_t)0x00000002U) /* Port x Set bit 1  */
#define GPIO_PBSC_PBS2             ((uint32_t)0x00000004U) /* Port x Set bit 2  */
#define GPIO_PBSC_PBS3             ((uint32_t)0x00000008U) /* Port x Set bit 3  */
#define GPIO_PBSC_PBS4             ((uint32_t)0x00000010U) /* Port x Set bit 4  */
#define GPIO_PBSC_PBS5             ((uint32_t)0x00000020U) /* Port x Set bit 5  */
#define GPIO_PBSC_PBS6             ((uint32_t)0x00000040U) /* Port x Set bit 6  */
#define GPIO_PBSC_PBS7             ((uint32_t)0x00000080U) /* Port x Set bit 7  */
#define GPIO_PBSC_PBS8             ((uint32_t)0x00000100U) /* Port x Set bit 8  */
#define GPIO_PBSC_PBS9             ((uint32_t)0x00000200U) /* Port x Set bit 9  */
#define GPIO_PBSC_PBS10            ((uint32_t)0x00000400U) /* Port x Set bit 10 */
#define GPIO_PBSC_PBS11            ((uint32_t)0x00000800U) /* Port x Set bit 11 */
#define GPIO_PBSC_PBS12            ((uint32_t)0x00001000U) /* Port x Set bit 12 */
#define GPIO_PBSC_PBS13            ((uint32_t)0x00002000U) /* Port x Set bit 13 */
#define GPIO_PBSC_PBS14            ((uint32_t)0x00004000U) /* Port x Set bit 14 */
#define GPIO_PBSC_PBS15            ((uint32_t)0x00008000U) /* Port x Set bit 15 */

#define GPIO_PBSC_PBC0             ((uint32_t)0x00010000U) /* Port x Reset bit 0  */
#define GPIO_PBSC_PBC1             ((uint32_t)0x00020000U) /* Port x Reset bit 1  */
#define GPIO_PBSC_PBC2             ((uint32_t)0x00040000U) /* Port x Reset bit 2  */
#define GPIO_PBSC_PBC3             ((uint32_t)0x00080000U) /* Port x Reset bit 3  */
#define GPIO_PBSC_PBC4             ((uint32_t)0x00100000U) /* Port x Reset bit 4  */
#define GPIO_PBSC_PBC5             ((uint32_t)0x00200000U) /* Port x Reset bit 5  */
#define GPIO_PBSC_PBC6             ((uint32_t)0x00400000U) /* Port x Reset bit 6  */
#define GPIO_PBSC_PBC7             ((uint32_t)0x00800000U) /* Port x Reset bit 7  */
#define GPIO_PBSC_PBC8             ((uint32_t)0x01000000U) /* Port x Reset bit 8  */
#define GPIO_PBSC_PBC9             ((uint32_t)0x02000000U) /* Port x Reset bit 9  */
#define GPIO_PBSC_PBC10            ((uint32_t)0x04000000U) /* Port x Reset bit 10 */
#define GPIO_PBSC_PBC11            ((uint32_t)0x08000000U) /* Port x Reset bit 11 */
#define GPIO_PBSC_PBC12            ((uint32_t)0x10000000U) /* Port x Reset bit 12 */
#define GPIO_PBSC_PBC13            ((uint32_t)0x20000000U) /* Port x Reset bit 13 */
#define GPIO_PBSC_PBC14            ((uint32_t)0x40000000U) /* Port x Reset bit 14 */
#define GPIO_PBSC_PBC15            ((uint32_t)0x80000000U) /* Port x Reset bit 15 */

/**  Bit definition for GPIO_PLOCK register **/
#define GPIO_PLOCK_PLOCK0          ((uint32_t)0x00000001U) /* Port x Lock bit 0  */
#define GPIO_PLOCK_PLOCK1          ((uint32_t)0x00000002U) /* Port x Lock bit 1  */
#define GPIO_PLOCK_PLOCK2          ((uint32_t)0x00000004U) /* Port x Lock bit 2  */
#define GPIO_PLOCK_PLOCK3          ((uint32_t)0x00000008U) /* Port x Lock bit 3  */
#define GPIO_PLOCK_PLOCK4          ((uint32_t)0x00000010U) /* Port x Lock bit 4  */
#define GPIO_PLOCK_PLOCK5          ((uint32_t)0x00000020U) /* Port x Lock bit 5  */
#define GPIO_PLOCK_PLOCK6          ((uint32_t)0x00000040U) /* Port x Lock bit 6  */
#define GPIO_PLOCK_PLOCK7          ((uint32_t)0x00000080U) /* Port x Lock bit 7  */
#define GPIO_PLOCK_PLOCK8          ((uint32_t)0x00000100U) /* Port x Lock bit 8  */
#define GPIO_PLOCK_PLOCK9          ((uint32_t)0x00000200U) /* Port x Lock bit 9  */
#define GPIO_PLOCK_PLOCK10         ((uint32_t)0x00000400U) /* Port x Lock bit 10 */
#define GPIO_PLOCK_PLOCK11         ((uint32_t)0x00000800U) /* Port x Lock bit 11 */
#define GPIO_PLOCK_PLOCK12         ((uint32_t)0x00001000U) /* Port x Lock bit 12 */
#define GPIO_PLOCK_PLOCK13         ((uint32_t)0x00002000U) /* Port x Lock bit 13 */
#define GPIO_PLOCK_PLOCK14         ((uint32_t)0x00004000U) /* Port x Lock bit 14 */
#define GPIO_PLOCK_PLOCK15         ((uint32_t)0x00008000U) /* Port x Lock bit 15 */
#define GPIO_PLOCK_PLOCKK          ((uint32_t)0x00010000U) /* Lock key */

/** Bit definition for GPIO_AFL register **/
#define GPIO_AFL_AFSEL0            ((uint32_t)0x0000000FU) /* Port x AFL bit (0..3) */
#define GPIO_AFL_AFSEL1            ((uint32_t)0x000000F0U) /* Port x AFL bit (4..7) */
#define GPIO_AFL_AFSEL2            ((uint32_t)0x00000F00U) /* Port x AFL bit (8..11) */
#define GPIO_AFL_AFSEL3            ((uint32_t)0x0000F000U) /* Port x AFL bit (12..15) */
#define GPIO_AFL_AFSEL4            ((uint32_t)0x000F0000U) /* Port x AFL bit (16..19) */
#define GPIO_AFL_AFSEL5            ((uint32_t)0x00F00000U) /* Port x AFL bit (20..23) */
#define GPIO_AFL_AFSEL6            ((uint32_t)0x0F000000U) /* Port x AFL bit (24..27) */
#define GPIO_AFL_AFSEL7            ((uint32_t)0xF0000000U) /* Port x AFL bit (27..31) */

