2zzyyyq/3C/CMSIS/device/n32g033.h
/** Bit definition for GPIO_AFH register **/
#define GPIO_AFH_AFSEL8            ((uint32_t)0x0000000FU) /* Port x AFH bit (0..3) */
#define GPIO_AFH_AFSEL9            ((uint32_t)0x000000F0U) /* Port x AFH bit (4..7) */
#define GPIO_AFH_AFSEL10           ((uint32_t)0x00000F00U) /* Port x AFH bit (8..11) */
#define GPIO_AFH_AFSEL11           ((uint32_t)0x0000F000U) /* Port x AFH bit (12..15) */
#define GPIO_AFH_AFSEL12           ((uint32_t)0x000F0000U) /* Port x AFH bit (16..19) */
#define GPIO_AFH_AFSEL13           ((uint32_t)0x00F00000U) /* Port x AFH bit (20..23) */
#define GPIO_AFH_AFSEL14           ((uint32_t)0x0F000000U) /* Port x AFH bit (24..27) */
#define GPIO_AFH_AFSEL15           ((uint32_t)0xF0000000U) /* Port x AFH bit (28..31) */

/** Bit definition for GPIO_PBC register **/
#define GPIO_PBC_PBC0              ((uint16_t)0x0001U) /* Port x Reset bit 0  */
#define GPIO_PBC_PBC1              ((uint16_t)0x0002U) /* Port x Reset bit 1  */
#define GPIO_PBC_PBC2              ((uint16_t)0x0004U) /* Port x Reset bit 2  */
#define GPIO_PBC_PBC3              ((uint16_t)0x0008U) /* Port x Reset bit 3  */
#define GPIO_PBC_PBC4              ((uint16_t)0x0010U) /* Port x Reset bit 4  */
#define GPIO_PBC_PBC5              ((uint16_t)0x0020U) /* Port x Reset bit 5  */
#define GPIO_PBC_PBC6              ((uint16_t)0x0040U) /* Port x Reset bit 6  */
#define GPIO_PBC_PBC7              ((uint16_t)0x0080U) /* Port x Reset bit 7  */
#define GPIO_PBC_PBC8              ((uint16_t)0x0100U) /* Port x Reset bit 8  */
#define GPIO_PBC_PBC9              ((uint16_t)0x0200U) /* Port x Reset bit 9  */
#define GPIO_PBC_PBC10             ((uint16_t)0x0400U) /* Port x Reset bit 10 */
#define GPIO_PBC_PBC11             ((uint16_t)0x0800U) /* Port x Reset bit 11 */
#define GPIO_PBC_PBC12             ((uint16_t)0x1000U) /* Port x Reset bit 12 */
#define GPIO_PBC_PBC13             ((uint16_t)0x2000U) /* Port x Reset bit 13 */
#define GPIO_PBC_PBC14             ((uint16_t)0x4000U) /* Port x Reset bit 14 */
#define GPIO_PBC_PBC15             ((uint16_t)0x8000U) /* Port x Reset bit 15 */

/** Bit definition for GPIOB_DS register **/
#define GPIO_DS_DS3               ((uint16_t)0x0008U) /* GPIOB_DS bit 3  */
#define GPIO_DS_DS4               ((uint16_t)0x0010U) /* GPIOB_DS bit 4  */
#define GPIO_DS_DS5               ((uint16_t)0x0020U) /* GPIOB_DS bit 5  */
#define GPIO_DS_SR3               ((uint16_t)0x0100U) /* GPIOB_DS bit 8  */
#define GPIO_DS_SR4               ((uint16_t)0x0200U) /* GPIOB_DS bit 9  */
#define GPIO_DS_SR5               ((uint16_t)0x0400U) /* GPIOB_DS bit 10 */

/** Bit definition for AFIO register **/

/** Bit definition for AFIO_CFG register **/
#define AFIO_CFG_SPI2_NSS           ((uint32_t)0x00800000U) /* AFIO_CFG bit 23 */
#define AFIO_CFG_SPI1_NSS           ((uint32_t)0x00400000U) /* AFIO_CFG bit 22 */
#define AFIO_CFG_EXTI_ETRR          ((uint32_t)0x00003800U) /* AFIO_CFG bit (11..13) */
#define AFIO_CFG_EXTIFILTEN         ((uint32_t)0x00000008U) /* AFIO_CFG bit 3 */
#define AFIO_CFG_IOFILTCFG          ((uint32_t)0x00000007U) /* AFIO_CFG bit (2..0) */

/**  Bit definition for AFIO_EXTI_CFG1 register **/
#define AFIO_EXTI_CFG1_EXTI0        ((uint16_t)0x0007) /* EXTI 0 configuration */
#define AFIO_EXTI_CFG1_EXTI1        ((uint16_t)0x0070) /* EXTI 1 configuration */
#define AFIO_EXTI_CFG1_EXTI2        ((uint16_t)0x0700) /* EXTI 2 configuration */
#define AFIO_EXTI_CFG1_EXTI3        ((uint16_t)0x7000) /* EXTI 3 configuration */

/* EXTI0 configuration */
#define AFIO_EXTI_CFG1_EXTI0_PA0   ((uint32_t)0x00000000U) /* PA[0] pin */
#define AFIO_EXTI_CFG1_EXTI0_PA1   ((uint32_t)0x00000001U) /* PA[1] pin */
#define AFIO_EXTI_CFG1_EXTI0_PA2   ((uint32_t)0x00000002U) /* PA[2] pin */
#define AFIO_EXTI_CFG1_EXTI0_PA3   ((uint32_t)0x00000003U) /* PA[3] pin */

/* EXTI1 configuration */
#define AFIO_EXTI_CFG1_EXTI1_PA4   ((uint32_t)0x00000000U) /* PA[4] pin */
#define AFIO_EXTI_CFG1_EXTI1_PA5   ((uint32_t)0x00000010U) /* PA[5] pin */
#define AFIO_EXTI_CFG1_EXTI1_PA6   ((uint32_t)0x00000020U) /* PA[6] pin */
#define AFIO_EXTI_CFG1_EXTI1_PA7   ((uint32_t)0x00000030U) /* PA[7] pin */

/* EXTI2 configuration */
#define AFIO_EXTI_CFG1_EXTI2_PA8   ((uint32_t)0x00000000U) /* PA[8] pin */
#define AFIO_EXTI_CFG1_EXTI2_PA9   ((uint32_t)0x00000100U) /* PA[9] pin */
#define AFIO_EXTI_CFG1_EXTI2_PA10  ((uint32_t)0x00000200U) /* PA[10] pin */
#define AFIO_EXTI_CFG1_EXTI2_PA11  ((uint32_t)0x00000300U) /* PA[11] pin */

/* EXTI3 configuration */
#define AFIO_EXTI_CFG1_EXTI3_PA12   ((uint32_t)0x00000000U) /* PA[12] pin */
#define AFIO_EXTI_CFG1_EXTI3_PA13   ((uint32_t)0x00001000U) /* PA[13] pin */
#define AFIO_EXTI_CFG1_EXTI3_PA14   ((uint32_t)0x00002000U) /* PA[14] pin */
#define AFIO_EXTI_CFG1_EXTI3_PA15   ((uint32_t)0x00003000U) /* PA[15] pin */

/**  Bit definition for AFIO_EXTI_CFG2 register **/
#define AFIO_EXTI_CFG2_EXTI4        ((uint16_t)0x0007U) /* EXTI 4 configuration */
#define AFIO_EXTI_CFG2_EXTI5        ((uint16_t)0x0070U) /* EXTI 5 configuration */
#define AFIO_EXTI_CFG2_EXTI6        ((uint16_t)0x0700U) /* EXTI 6 configuration */

/* EXTI4 configuration */
#define AFIO_EXTI_CFG2_EXTI4_PB0   ((uint32_t)0x00000000U) /* PB[0] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB1   ((uint32_t)0x00000001U) /* PB[1] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB2   ((uint32_t)0x00000002U) /* PB[2] pin */
#define AFIO_EXTI_CFG2_EXTI4_PB3   ((uint32_t)0x00000003U) /* PB[3] pin */

/* EXTI5 configuration */
#define AFIO_EXTI_CFG2_EXTI5_PB4   ((uint32_t)0x00000000U) /* PB[4] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB5   ((uint32_t)0x00000010U) /* PB[5] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB6   ((uint32_t)0x00000020U) /* PB[6] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB7   ((uint32_t)0x00000030U) /* PB[7] pin */
#define AFIO_EXTI_CFG2_EXTI5_PB8   ((uint32_t)0x00000040U) /* PB[8] pin */

/* EXTI6 configuration */
#define AFIO_EXTI_CFG2_EXTI6_PF0   ((uint32_t)0x00000000U) /* PF[0] pin */
#define AFIO_EXTI_CFG2_EXTI6_PF1   ((uint32_t)0x00000100U) /* PF[1] pin */
#define AFIO_EXTI_CFG2_EXTI6_PF2   ((uint32_t)0x00000200U) /* PF[2] pin */
#define AFIO_EXTI_CFG2_EXTI6_PF3   ((uint32_t)0x00000300U) /* PF[3] pin */

/** Bit definition for AFIO_DIGEFT_CFG1 register **/
#define AFIO_DIGEFT_CFG1_PA0DIGEFTEN  ((uint32_t)0x00000001U) /* PA[0]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA1DIGEFTEN  ((uint32_t)0x00000002U) /* PA[1]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA2DIGEFTEN  ((uint32_t)0x00000004U) /* PA[2]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA3DIGEFTEN  ((uint32_t)0x00000008U) /* PA[3]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA4DIGEFTEN  ((uint32_t)0x00000010U) /* PA[4]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA5DIGEFTEN  ((uint32_t)0x00000020U) /* PA[5]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA6DIGEFTEN  ((uint32_t)0x00000040U) /* PA[6]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA7DIGEFTEN  ((uint32_t)0x00000080U) /* PA[7]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA8DIGEFTEN  ((uint32_t)0x00000100U) /* PA[8]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA9DIGEFTEN  ((uint32_t)0x00000200U) /* PA[9]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA10DIGEFTEN ((uint32_t)0x00000400U) /* PA[10] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA11DIGEFTEN ((uint32_t)0x00000800U) /* PA[11] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA12DIGEFTEN ((uint32_t)0x00001000U) /* PA[12] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA13DIGEFTEN ((uint32_t)0x00002000U) /* PA[13] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA14DIGEFTEN ((uint32_t)0x00004000U) /* PA[14] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA15DIGEFTEN ((uint32_t)0x00008000U) /* PA[15] DIGEFT IE */

